{
  "C Mauritius (Hotel)": {
    "googleRating": 4.7,
    "totalReviews": 1017,
    "googleMapsUrl": "https://maps.google.com/?cid=10489011742365398502&g_mp=CiVnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLkdldFBsYWNlEAIYBCAA",
    "editorialSummary": "Casual rooms in an upmarket all-inclusive resort with 2 restaurants, beach access & an outdoor pool.",
    "reviews": [
      {
        "author": "Natasha G W",
        "rating": 5,
        "text": "I spent the day here with my son and had the pleasure of enjoying lunch at their buffet. At a glance the offerings look small but once you go round, you quickly notice that there is something for everyone. Grilled fish on demand, salads made to order, curries, European, local - something for everyone.\n\nThe hotel layout and 3 pools means there is enough space for everyone to spread out, sun loungers are easily available. My son enjoyed the beach toys and all 3 pools, the largest being a favourite.\n\nI really enjoyed the boutique feel, the warm welcome and friendly service. This hotel has made the 'staycation' shortlist and we will likely return. Thank you C resort and Jesh for a pleasant day!",
        "timeAgo": "a week ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocKiwFOtvkrYoSd4gErA7EtFZcKIsr8TBF_OepJi2Kn8_MBTSQ=s128-c0x00000000-cc-rp-mo-ba2",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/104503573388352296326/reviews"
      },
      {
        "author": "Teena",
        "rating": 5,
        "text": "I celebrated my 40th birthday at this magnificent hotel and could not have chosen a more perfect place. Five nights passed by in a flash, with everything running smoothly from start to finish.\nThe welcome was warm and professional, from the lovely ladies and gents at check-in to the Assistant Director. Special thanks to Jay, Lucky, and Akshaye at the restaurant, and Deepak at Wok n Roll — truly attentive professionals who clearly love what they do.\nThe setting is calm, intimate, and simply beautiful. The spa is a real gem in a spectacular location, and the massage was a must.One of the best experiences we’ve ever had. Thank you to the entire team . We will definitely be back. Highly recommended ❤️",
        "timeAgo": "a week ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocJSR_Qu4wFcrICxHe7Bz9xYNE1yzSj1b88bpTJSK6vbmgwk0w=s128-c0x00000000-cc-rp-mo-ba2",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/116147966243167679467/reviews"
      },
      {
        "author": "Vivienne Simpson",
        "rating": 5,
        "text": "We bought a day pass for the hotel and what a magnificent day we spent at C Mauritius. The location is superb. The beach is out of this world. We took a 2km walk before lunch. Lunch was a buffet and full of every sort of option from vegetarian, curries, pizzas, paella, fresh fish! It was all there. Our favorite was the salad bar where the lady concocted the most delicious salads. There was a huge selection of desserts and ice creams for after. The staff are pleasant and efficient. The setting is idyllic and there are 3 swimming pools to enjoy besides the best swims in the ocean. There is a beach bar with fast and friendly service. We spent the afternoon lying by the sea on comfortable loungers. We then had afternoon tea served and ate far too many delicious pancakes! All in all it was one of the best days we have spent this holiday and we will be sure to go back! Thank you for a super holiday whilst on holiday! We will come back",
        "timeAgo": "a month ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjU1bzvjkLaHqmYW80YGxaQiA33VrxKYP30I_3e-Z8fv7HAuNOUDxg=s128-c0x00000000-cc-rp-mo-ba6",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/109006024830471589363/reviews"
      },
      {
        "author": "Magalie Marie",
        "rating": 5,
        "text": "I recently had the pleasure of staying at C Mauritius with my family over the weekend, and I must say, it was an unforgettable experience! From the moment we arrived, the staff were friendly, welcoming, and went above and beyond to make our stay special.\n\nThe facilities were stunning, and we felt pampered and relaxed throughout our stay. The extra touches that really made our stay stand out included:\n\n- A warm welcome by Queen with amazing concoctions from the girl at arrival kiosk\n- Exceptional service from Jesh in the restaurant on the first evening, and Wadie and the other waiter (whose name I forgot) on Saturday evening\n- Marie's attentive service on Saturday, ensuring we had everything we needed to the final bottle of red the whole family really loved\n- The barman at the beach, who created a special birthday mocktail for Novak\n\nBut it's not just the front-of-house staff who made our stay special - the behind-the-scenes team, including the maintenance guy and cleaning staff, were all incredibly helpful and added to the overall experience.\n\nA big thank you to Catherine, who works at the resort, for being an amazing host and making sure we had a great time. Your hard work and dedication to providing an exceptional experience for guests really shows, and you're a valuable asset to the group!\n\nWe can't wait to come back and experience it all again. Highly recommended!",
        "timeAgo": "2 weeks ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjXvawu2JRXScu3qKa51DGMoogXLcKUBql2xq-ACXfvF9umNsyg=s128-c0x00000000-cc-rp-mo",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/103844464548515497717/reviews"
      },
      {
        "author": "Gayathri Kasilingam",
        "rating": 5,
        "text": "Amazing, amazing staff. Very good dinner and breakfast buffets. Beautiful place to just spend time\nOne thing, while booking rooms in Mauritius, that you should be careful of is that this part of the island is not very accessible to the main Port Louis and also to the main national parks, La Monne, Treks, etc. All of those are at least more than an hour from the location. Before booking please keep that in mind.",
        "timeAgo": "a week ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjVVoL8ar9sSm58_RLsiWhEQv1zsVmbzQR2ZXc0OMjgjsiuWURUlxw=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/106468150930169334545/reviews"
      }
    ],
    "photos": [
      {
        "url": "/photos/c-mauritius-hotel-0.jpg",
        "attribution": "C Mauritius",
        "width": 1920,
        "height": 1200
      },
      {
        "url": "/photos/c-mauritius-hotel-1.jpg",
        "attribution": "C Mauritius",
        "width": 1920,
        "height": 1200
      },
      {
        "url": "/photos/c-mauritius-hotel-2.jpg",
        "attribution": "Ufuk Cevikel",
        "width": 4080,
        "height": 3060
      },
      {
        "url": "/photos/c-mauritius-hotel-3.jpg",
        "attribution": "Tennessee De Mendonca",
        "width": 4608,
        "height": 2184
      },
      {
        "url": "/photos/c-mauritius-hotel-4.jpg",
        "attribution": "C Mauritius",
        "width": 1920,
        "height": 1200
      }
    ]
  },
  "Black River Gorges National Park": {
    "googleRating": 4.6,
    "totalReviews": 3991,
    "googleMapsUrl": "https://maps.google.com/?cid=13020248915911721534&g_mp=CiVnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLkdldFBsYWNlEAIYBCAA",
    "editorialSummary": "Large rainforest park offering 2 information centers, picnic areas & 60 km. of hiking trails.",
    "reviews": [
      {
        "author": "Melissa Cofield-Johnson",
        "rating": 4,
        "text": "We love taking walks here. I suggest comfortable shoes with thick soles as often the rocks along the trail are uncovered. Be sure to bring your bug spray and then, enjoy your walk. There's a detailed sign giving directions for your preferred level of difficulty. There are places to have a meal near the visitors center. All-in-all, a great place to spend an afternoon.",
        "timeAgo": "3 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjWWMusa5Oc-nuwT675eUHcQBO2fazltr6V3EP_QLN785hbX_Yc9=s128-c0x00000000-cc-rp-mo-ba3",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/105463221740862936585/reviews"
      },
      {
        "author": "Vaishnavi R",
        "rating": 4,
        "text": "Very peaceful place!\nThe little boutiques are cute and very ecologic!\n\nThe monkeys are cutee and know how to pose for the camera😅😅\n\nThe little issues are that the ice cream trucks sells ice cream and cakes at exorbitant prices and this in my opinion should be a controlled one\nAnd also bathroom services would be greatly appreciated since this is a big touristy area and usually crowded!\nOtherwise great view, maintained natural spaces!\nRecommended 100%\nPlus point for zero entry fees!",
        "timeAgo": "2 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocK6VQ-PXhMvKz-qN4E-RlrjjF3FfEskqEs-KfW8Zl0SKJgbww=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/100271610599272900630/reviews"
      },
      {
        "author": "Charles Ng",
        "rating": 5,
        "text": "À fantastic park, a biosphere reserve, a must visit. Alexandra Falls is one place to see, also a viewpoint to see the north side of the Black River Gorge.",
        "timeAgo": "a week ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjW_-BqGKlUpXXQ8JNTOrWETIaFw7RaM-aGoSbLfDfzWVWTU95zG=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/116156068854234405097/reviews"
      },
      {
        "author": "Sean",
        "rating": 5,
        "text": "Easy and very plesent hike up the moutain to the first easy view point, about 45-60 mins each way views were stunning, even if your not a good walker it is very doable and well worth it, nice place to rest up at the top lil open air hut with roof and benches, would reccomend you bring snacks and drinks with you before you travel here as nothing is close by to buy any before you start the hike",
        "timeAgo": "3 weeks ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocLDts6N6kkTs6cPj3qFmoZY9KH2YIa1MwQ-rk6DDTAkLMLN91U=s128-c0x00000000-cc-rp-mo-ba2",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/103446782716152468454/reviews"
      },
      {
        "author": "René W",
        "rating": 4,
        "text": "A lovely natural spot. We walked from the Petrin entrance following the Machabees forest loop which took around 2.5hrs. Worth a visit if you have time, but personally we preferred the Tamarind Falls hike where you can swim and enjoy a waterfall massage.",
        "timeAgo": "5 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjU91EIui8Lyew_ZtG_oqBtMKIVfngGxCFe-WZcAH-cH_EnnLBk6=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/101490447836276858167/reviews"
      }
    ],
    "photos": [
      {
        "url": "/photos/black-river-gorges-national-park-0.jpg",
        "attribution": "Glenn Mervyn Miller",
        "width": 4032,
        "height": 3024
      },
      {
        "url": "/photos/black-river-gorges-national-park-1.jpg",
        "attribution": "Benoit Rioux",
        "width": 4032,
        "height": 3024
      },
      {
        "url": "/photos/black-river-gorges-national-park-2.jpg",
        "attribution": "Laurent Quentin",
        "width": 1440,
        "height": 1080
      },
      {
        "url": "/photos/black-river-gorges-national-park-3.jpg",
        "attribution": "John-Harald Nymoen",
        "width": 4000,
        "height": 3000
      },
      {
        "url": "/photos/black-river-gorges-national-park-4.jpg",
        "attribution": "Adam Gralki",
        "width": 4032,
        "height": 2268
      }
    ]
  },
  "Le Morne Brabant (UNESCO)": {
    "googleRating": 4.8,
    "totalReviews": 611,
    "googleMapsUrl": "https://maps.google.com/?cid=11037177701620775411&g_mp=CiVnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLkdldFBsYWNlEAIYBCAA",
    "editorialSummary": "Historic 1,824-ft. mountain offering a scenic & challenging climb to its sweeping views at the top.",
    "reviews": [
      {
        "author": "Mariam",
        "rating": 5,
        "text": "Climbing Le Morne Brabant (and going back down 😮‍💨) was honestly hard and not really my thing. My muscles were screaming, my lungs were negotiating, and I questioned all my life choices along the way. BUT… the view at the top? Worth every single muscle pain, shaky leg, and dramatic breath. Unforgettable experience.",
        "timeAgo": "a week ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjVxQR6OCR6EbLqunjAWwmWAdRElcjUbVtEcO4x79ueUoHBTIBU=s128-c0x00000000-cc-rp-mo-ba3",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/105407017051569818276/reviews"
      },
      {
        "author": "Davinia Aubeeluck",
        "rating": 5,
        "text": "Start early, bring water and ideally a sandwich on top is great. One of the most memorable places and rewarding hike i have ever done. The view is spectacular.",
        "timeAgo": "a month ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocI6-mznaLObTOq3fc2fuuFIiGCl7t2tByP3BG4wTo_eARXdIQ=s128-c0x00000000-cc-rp-mo-ba2",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/110015984921897606051/reviews"
      },
      {
        "author": "O and N",
        "rating": 4,
        "text": "Easy part 1 and more challenging part 2. The day we went wad way too crowded. Many climbed to the summit and you could just tell from their face how scared they were to go down w.out the right shoes or equipment. 3 days after we climbed up, we didnt go to the peak as the last climbed was jammed with ppl of all sorts of levels, we heared of the tragic accident of a young man. Just a reminder that climbing this mountain comes with high risk. Please avoid when too crowded on the last bit.",
        "timeAgo": "5 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjU4YfAelZyB4PHv9y5WgPp3opmgXkxSI3gu_m9DDt4RE6RYVEM=s128-c0x00000000-cc-rp-mo-ba6",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/113118582898167722953/reviews"
      },
      {
        "author": "Michelle Kahn",
        "rating": 5,
        "text": "Well marked out but very steep hike. Bring a lot of water, suncream, some snacks, a hat/cap. You'll  turn off the main road to a dirt road, drive 1 km and find a parking area. Nothing formal. Then there is a gate. When you walk through you'll find a book on the right side where you need to sign in and out (this is the only way for them to track people hiking safely). Our total hike was close to 8kms. We went to see the look out point that veers off to the right before you reach the steep climbing point which is why it maybe took us longer. The climbing is intense, and as you get to the top it plays on your mind a bit because you go down and then back up before reaching the top. Wear shoes with good grip and take things slowly and carefully! There used to be ropes but these no longer exist. You'll be rewarded with magnificent views as you go up and at the summit, along with lots of cute little birds! The summit is a relatively small area with a cross on the top.",
        "timeAgo": "a year ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjVCloda5uOU-89bf9Cq71jN5MWy_ozkRZadtXWThoBTrIUiZUcwqg=s128-c0x00000000-cc-rp-mo-ba5",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/103700908672298729504/reviews"
      },
      {
        "author": "Som Montree",
        "rating": 5,
        "text": "An unforgettable lifetime experience. A great, breathtaking view from the top, it was worth a hike.\nMy suggestion for the hike:\n1. start as early as possible. We started at 6 o’clock in the morning and at 7 o’clock it was almost unbearable hot. It’s a lot of climbing and the stone would get also hotter in the sun.\n2. Bring a lot of water with you, at least 1 L/person.\n3. I would suggest to hire a guide if you don’t have an experience in climbing. We did often a hike in the alps but I was so afraid that I wouldn’t survive this hike. We were lucky that we accidentally mixed up with the guided group and we could follow them, otherwise we wouldn’t be able to get to the top.",
        "timeAgo": "a year ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjWNPsmQKIkcLD3ucdH-uzneAzuetqPP_eysW301LCF47KFspDE9lw=s128-c0x00000000-cc-rp-mo-ba6",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/105095280956723751075/reviews"
      }
    ],
    "photos": [
      {
        "url": "/photos/le-morne-brabant-unesco-0.jpg",
        "attribution": "Lenka Milichovská",
        "width": 4032,
        "height": 3024
      },
      {
        "url": "/photos/le-morne-brabant-unesco-1.jpg",
        "attribution": "Eric Lavarec",
        "width": 4032,
        "height": 3024
      },
      {
        "url": "/photos/le-morne-brabant-unesco-2.jpg",
        "attribution": "Lau et Cath de Belgique War",
        "width": 4640,
        "height": 3472
      },
      {
        "url": "/photos/le-morne-brabant-unesco-3.jpg",
        "attribution": "Dr. Arthur Movsisyan",
        "width": 2048,
        "height": 1536
      },
      {
        "url": "/photos/le-morne-brabant-unesco-4.jpg",
        "attribution": "Vibungsan",
        "width": 1024,
        "height": 1001
      }
    ]
  },
  "Seven Coloured Earths": {
    "googleRating": 4.3,
    "totalReviews": 13395,
    "googleMapsUrl": "https://maps.google.com/?cid=4568737335768181461&g_mp=CiVnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLkdldFBsYWNlEAIYBCAA",
    "editorialSummary": "Park with sand dunes comprising of 7 different colors, plus a waterfall, a cafe & tortoises.",
    "reviews": [
      {
        "author": "Sweta Dhondoo (Deana Bye)",
        "rating": 4,
        "text": "Nice place.. clean, helpful staff; not so expensive the entry fee. Loved the views and tortoises 🐢 beautiful soil, however earlier this place was even more beautiful! Now, it seems faded a bit. The souvenir shop is nice, for local a bit expensive but quality products sold to tourists 👌\n\n🅿️ Parking: ✅️\n♿ Wheelchair Accessibility: ❌️ difficult\n♿ 🅿️ Wheelchair Parking: ✅️\n♿ 🚻 Wheelchair WC: ⁉️ unsure\n📶 Wifi: ✅️ at the coffee shop yes\n💳 Debit / Credit Card: ✅️\n📱Juice/ myT: ✅️\n🛗 Lift/ramp : ❌️\n♻️ Recycle : ✅️",
        "timeAgo": "3 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjVpnq8XfPOhZ639TLNgHmFKTcsJvE8HXaIHyxFMclqZtKBTXV2I=s128-c0x00000000-cc-rp-mo-ba6",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/109306133423166865949/reviews"
      },
      {
        "author": "Stephy M",
        "rating": 5,
        "text": "The Seven Colored Earths of Mauritius is a wonderful attraction. I really enjoyed it because you can see the different colors of the earth, which is truly stunning. I loved it! It's a large area with many other views to enjoy, so it's not just about the colored earths. I recommend wearing comfortable shoes, like sports clothes, so you can walk around easily. I highly recommend visiting this place.",
        "timeAgo": "5 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocKoTzI3WUYHdq1EwZueknb0hWE9K5i6kLUcm8bWKSYqds3NRQ=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/100792860714025093778/reviews"
      },
      {
        "author": "Kashif Abdul Razzaq Misidia",
        "rating": 5,
        "text": "This is a very stunning place, and I would say it is one of the natural wonders of Mauritius 🇲🇺.\nThis was my first visit, although I was already familiar with it through photos on Google Maps.\n\nThe entry fee for foreigners was 750 MRU, and for locals it was around 300 MRU.\nThe ticket includes access to the waterfall and the rest of the national park where you can roam freely.\n\nMy friend told me that the Seven Coloured Earth used to look much brighter and more shiny in the past, but over time, due to rain and sunlight, the colours have become a bit dull.\nEarlier, visitors were allowed to walk on the dunes of the Seven Colours, but now they have placed boundaries and stopped access.\n\nThere is also a turtle sanctuary, where turtles of different sizes and ages are kept.\nThere was a separate enclosed area for the eggs to hatch.\n\nThe entire place is fully ♿ accessibility friendly and eco friendly.\nThere are separate bins placed for different types of trash.\n\nThe 🅿️♿parking area is very large and accessibility friendly.",
        "timeAgo": "2 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjXLdyxbpZDEOJAgX8KYUk6ToGCyq-8TU7xbM_IB3u0oYxfX_mCWyA=s128-c0x00000000-cc-rp-mo-ba8",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/113453064043300985454/reviews"
      },
      {
        "author": "Gayathri Kasilingam",
        "rating": 4,
        "text": "One of a kind, of course, but I don't think the entry ticket price is worth what is inside unless you're spending a really long time. We just spent time in the waterfall and the seven earth and didn't feel it was worth our money but definitely worth the visit.",
        "timeAgo": "a week ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjVVoL8ar9sSm58_RLsiWhEQv1zsVmbzQR2ZXc0OMjgjsiuWURUlxw=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/106468150930169334545/reviews"
      },
      {
        "author": "Ameya A Gaandhe",
        "rating": 5,
        "text": "Unique experience with Waterfall, 7 coloured earth & Turtles. Be prepare to spend MUR650 per person as an entry fees due to private site. Cafe, Souvenir Store is plenty to offer local Rum & other food items as well as crafted artworks by local artists. Definitely worth the visit",
        "timeAgo": "4 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjXvu-VJUWz14AEZTTA_xDsvBILoOzAAX5P-utBvr5wavB6tYQ7m=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/117472403386811784928/reviews"
      }
    ],
    "photos": [
      {
        "url": "/photos/seven-coloured-earths-0.jpg",
        "attribution": "Laurence Guionie",
        "width": 4032,
        "height": 3024
      },
      {
        "url": "/photos/seven-coloured-earths-1.jpg",
        "attribution": "Olga Lavrenteva",
        "width": 3024,
        "height": 4032
      },
      {
        "url": "/photos/seven-coloured-earths-2.jpg",
        "attribution": "Pablo Duran (Pablotrotamundos)",
        "width": 4800,
        "height": 3600
      },
      {
        "url": "/photos/seven-coloured-earths-3.jpg",
        "attribution": "Em",
        "width": 1440,
        "height": 1080
      },
      {
        "url": "/photos/seven-coloured-earths-4.jpg",
        "attribution": "seb fort",
        "width": 3024,
        "height": 4032
      }
    ]
  },
  "Chamarel Waterfall": {
    "googleRating": 4.5,
    "totalReviews": 5349,
    "googleMapsUrl": "https://maps.google.com/?cid=5944076051794818186&g_mp=CiVnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLkdldFBsYWNlEAIYBCAA",
    "editorialSummary": "These picturesque, 272-ft. waterfalls can be viewed from an upper deck & base with shallow swimming.",
    "reviews": [
      {
        "author": "Kashif Abdul Razzaq Misidia",
        "rating": 5,
        "text": "Chamarel Waterfall was one of the places that really impressed me in Mauritius. The view of the water falling into a deep green valley looked powerful and calm at the same time. The whole area felt fresh because of the thick forest around it.\n\nI reached the lower viewpoint in a few steps from the parking area. The upper viewpoint was even better. The stairs were easy to use and they added a handrail, which helped a lot. Accessibility was decent. It can be a little tough for a ♿wheelchair because of the height, but still possible with support.\n\nEven in summer, the waterfall looked beautiful. I can imagine how strong and loud it becomes in the monsoon season. The sound of water and birds created a very peaceful environment. I really enjoyed that moment.\n\nThe ticket is included with the Chamarel Seven Colored Earth. For foreigners it is around 650 MRU, and cheaper for local residents.\n\nIf you are in Chamarel, this waterfall should be on your list. The views are clean, the place feels natural, and the visit stays in your memory.",
        "timeAgo": "2 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjXLdyxbpZDEOJAgX8KYUk6ToGCyq-8TU7xbM_IB3u0oYxfX_mCWyA=s128-c0x00000000-cc-rp-mo-ba8",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/113453064043300985454/reviews"
      },
      {
        "author": "jian gu",
        "rating": 4,
        "text": "After entering the ticket office/gate control, it takes about 2 -3 minutes drive to reach the waterfall carpark. A the waterfall is immediately next to the carpark. The are two observation decks at different height levels for people to watch the waterfall. It's told that locals are able to walk to the top of the waterfall, but tourists are not allowed to do the same",
        "timeAgo": "2 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjV_-q_9YqZGVjaTqsFE-YAY1LFqUYWSGCG6we5Ruz12LB_KgAXO9A=s128-c0x00000000-cc-rp-mo-ba7",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/117587585299306542775/reviews"
      },
      {
        "author": "Anujay Akash Shukla",
        "rating": 5,
        "text": "Breathtaking View Surrounded by Lush Greenery\n\nChamarel Waterfall is an absolute gem and a must-see when visiting the area. The view from the main viewpoint is stunning — the waterfall plunges dramatically into a forested gorge, surrounded by rich, tropical greenery that makes the whole scene look like something out of a postcard.\n\nThe sound of the water and the fresh air make it a refreshing and peaceful stop. It’s a great spot for nature lovers and photographers alike. Whether you're visiting as part of the Seven Coloured Earths experience or just passing through Chamarel, this waterfall is definitely worth the stop!",
        "timeAgo": "6 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjXylss-fYXBxoU7UtKYPUa3TXgSUyh9HffrfkEFHXypyzFyxSrc=s128-c0x00000000-cc-rp-mo-ba6",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/113284545638448596934/reviews"
      },
      {
        "author": "Samo",
        "rating": 5,
        "text": "Visiting Chamarel Waterfall was truly one of the highlights of my trip to Mauritius. Tucked away in the lush southwestern part of the island, this stunning waterfall is a breathtaking sight that perfectly captures the natural beauty of Mauritius.\n\nAt around 100 meters tall, it's the tallest single-drop waterfall in the country, and the view from the main observation deck is simply unforgettable. Surrounded by tropical greenery and dramatic cliffs, the waterfall cascades with such elegance and power that you can't help but feel a sense of awe. The sound of the rushing water combined with the fresh, earthy scent of the forest makes the whole experience incredibly peaceful and rejuvenating.\n\nOne of the best parts of the visit was how well-maintained the area is. The viewing platforms offer fantastic photo opportunities, and the path is easy to navigate, making it accessible for visitors of all ages. There is free parking available right near the viewpoint, making access hassle-free. After taking in the stunning scenery, you can also relax at nearby coffee shops and eateries just a short drive away, perfect for resting and enjoying some local flavors.\nIn addition, near the waterfall, you can visit the tortoise nest and enclosure, where you’ll get a chance to see these gentle giants up close a unique and charming addition to your visit.\nIf you're already exploring the nearby Seven Colored Earths, this is just a short walk or drive away and absolutely worth it.\nWhether you're a nature lover, a photographer, or simply looking for a serene escape, Chamarel Waterfall is a place that will leave a lasting impression. I highly recommend adding it to your Mauritius itinerary it's a natural gem not to be missed!",
        "timeAgo": "5 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjV2vIUWif1bffOr6HF5AqGjpPdqelRfU4_k_f6x31U87MKrNQ=s128-c0x00000000-cc-rp-mo-ba5",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/113674809886796809919/reviews"
      },
      {
        "author": "Rene",
        "rating": 5,
        "text": "Such a wonderful experience and a beautiful sight 😍 the hike was definitely worth it !!! Wear hiking shoes if you are not use to hiking !! It’s a bit steep :)",
        "timeAgo": "5 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocIGHRL-gJi-9Y1WicorjREO1WIeku6ZHmWHmXTVlxwPT3jdT2M=s128-c0x00000000-cc-rp-mo-ba2",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/116120612849042294155/reviews"
      }
    ],
    "photos": [
      {
        "url": "/photos/chamarel-waterfall-0.jpg",
        "attribution": "Francesca S.",
        "width": 1200,
        "height": 1600
      },
      {
        "url": "/photos/chamarel-waterfall-1.jpg",
        "attribution": "Pierre-Olivier Vernet",
        "width": 4656,
        "height": 3492
      },
      {
        "url": "/photos/chamarel-waterfall-2.jpg",
        "attribution": "Sachin Kanna",
        "width": 917,
        "height": 1280
      },
      {
        "url": "/photos/chamarel-waterfall-3.jpg",
        "attribution": "Rakan AlQ",
        "width": 3024,
        "height": 4032
      },
      {
        "url": "/photos/chamarel-waterfall-4.jpg",
        "attribution": "Lucas Georgiadis",
        "width": 3600,
        "height": 4800
      }
    ]
  },
  "Trou aux Cerfs Crater": {
    "googleRating": 4.2,
    "totalReviews": 175,
    "googleMapsUrl": "https://maps.google.com/?cid=11252036545247170880&g_mp=CiVnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLkdldFBsYWNlEAIYBCAA",
    "editorialSummary": "Approximately 300m crater of a dormant volcano, with lush vegetation surrounding a small lake.",
    "reviews": [
      {
        "author": "shashank agarwal",
        "rating": 4,
        "text": "We visited Trou aux Cerfs on Oct 01 after exploring Ganga Talao, and it was a refreshing stop! This is a volcanic crater with a small lake in the middle, and the road goes all the way up, making it super convenient to drive right to the top 🚗✨\n\nFrom the crater’s edge, you can enjoy breathtaking panoramic views of the surrounding areas 🏞️ and feel the cool mountain breeze blowing constantly 🌬️🌺 — such a peaceful and rejuvenating experience! Majority of the crater is lush with green trees, adding to its natural charm 🌳🌿\n\nA quick yet must-visit scenic spot in Mauritius — perfect for nature lovers and photographers 📸💚",
        "timeAgo": "4 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjVI8InS1u66CMXCk7ySVjHGKlWzNajVHx_VkPyiziMvysJZVd-PKQ=s128-c0x00000000-cc-rp-mo-ba6",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/111208676305663756606/reviews"
      },
      {
        "author": "Alaa Aljohani",
        "rating": 4,
        "text": "The view and the scenery worth the trip , bring water and snakes with you especially if you brought your kids with you.",
        "timeAgo": "6 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocLsCKzJMvxfSVDYDtylWTMbvw7Wg-ii3xn2Ijo7eCQLMDnsUA=s128-c0x00000000-cc-rp-mo-ba2",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/115496862293116774476/reviews"
      },
      {
        "author": "Ксения Л.",
        "rating": 4,
        "text": "nice place.  on the site of the volcano crater there is a small lake, everything around is overgrown with grass.  You can’t go down, you can only look from above.  You can take a walk around the crater.  There are wild monkeys in the area and they might bite you.  admission is free, parking available",
        "timeAgo": "a year ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjVXvTUhig1OL7D7SpRzIh8X0xK8TfBUDlWbgGZYLpmfc3GgqRabWw=s128-c0x00000000-cc-rp-mo-ba6",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/106131908970656118615/reviews"
      },
      {
        "author": "Jason Christopher",
        "rating": 5,
        "text": "Place has been properly preserved. Fitness machines available for all ages. Crater of dormant volcano can be seen through some angles. Has a considerable amount of benches and toilet is paid but clean. View of buildings (horizon) is impressive and recommended for amateurs of photography. Entire crater could be seen using a Quadcopter. Parking is limited but available though.",
        "timeAgo": "7 years ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjUmSaWeTnrQPLCk5-GU22Oko2H5VinOFmNKur7FmmcbYlyM4JXW=s128-c0x00000000-cc-rp-mo-ba5",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/115107723222767355933/reviews"
      },
      {
        "author": "Neeraj Redkar",
        "rating": 4,
        "text": "This is a volcanic crater with a lake in the middle. The road has been built right till the top, so one can directly drive to the crater and enjoy the scenary from the mountain top. Couple of best things to enjoy here are the scenic views of the surroundings and the cool breeze/wind at the top. Majority of the crater is filled with trees but the lake in the middle is good to look at.",
        "timeAgo": "7 years ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjVfjzJLQbW7uK-6hIIjusM97AawFAHsaUl15Q_jahau-lIh6Ijfiw=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/117029344042811494468/reviews"
      }
    ],
    "photos": [
      {
        "url": "/photos/trou-aux-cerfs-crater-0.jpg",
        "attribution": "Thomas Authier",
        "width": 4032,
        "height": 3024
      },
      {
        "url": "/photos/trou-aux-cerfs-crater-1.jpg",
        "attribution": "Fabienne Hoarau",
        "width": 4000,
        "height": 3000
      },
      {
        "url": "/photos/trou-aux-cerfs-crater-2.jpg",
        "attribution": "Martin Brejcha",
        "width": 4800,
        "height": 3600
      },
      {
        "url": "/photos/trou-aux-cerfs-crater-3.jpg",
        "attribution": "Loana Foubert",
        "width": 3024,
        "height": 4032
      },
      {
        "url": "/photos/trou-aux-cerfs-crater-4.jpg",
        "attribution": "idan gonen",
        "width": 4032,
        "height": 1960
      }
    ]
  },
  "Île aux Cerfs": {
    "googleRating": 4.4,
    "totalReviews": 1277,
    "googleMapsUrl": "https://maps.google.com/?cid=1400027396013895297&g_mp=CiVnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLkdldFBsYWNlEAIYBCAA",
    "editorialSummary": "Offshore island with white-sand beaches, boating & water sports, plus restaurants & a golf course.",
    "reviews": [
      {
        "author": "Anna-Marie Dutton",
        "rating": 4,
        "text": "Easy access via the Pointe Maurice ferry. Large shady parking area. Return ferry is 450 mur payable once you arrive at the island (this includes a welcome drink, a sun lounger & umbrella. More options including lunch are also available. Take a towel, water shoes, sun cream & snorkel gear. Take your own lunch & drinks if required. Beautiful beach area, loads of natural shade & return boats every half hour from 9.30am to 5pm. Many options for trips such as glass bottomed boat & parasailing offered, but not pushy sales. Good shallow area for children.",
        "timeAgo": "2 weeks ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjVZTYkI840ZKSlEy0-MhYw5EnaQFNxZTyiPbenAnH-t1eJydOieMg=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/112032270052299139057/reviews"
      },
      {
        "author": "Edward Briggs",
        "rating": 5,
        "text": "Very beautiful little island, it’s busy where the boats drop you off, just walk down the beach path to find a lot of quiet little spots.",
        "timeAgo": "3 weeks ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjXkifCEv45_IoIVQzJgo2LkjtxDS512a7KJrSYM_j3Xz09hdp0T=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/105890388146648494610/reviews"
      },
      {
        "author": "Kristina Radojicic",
        "rating": 5,
        "text": "The island is beautiful and peaceful, perfect for relaxing on the beach. It offers several water activities, which are great fun. The waterfall is stunning. We went on a catamaran with a smaller group of people — a relaxing one-day excursion.",
        "timeAgo": "4 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjUXR8Rjs0TcwlZQgsdZhCxCwMn1_L4Wl4WvXJfarm0qq9IfhoI4JQ=s128-c0x00000000-cc-rp-mo-ba3",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/113572297388928421273/reviews"
      },
      {
        "author": "Eliza Udrea",
        "rating": 1,
        "text": "If you ever been to Greece or Italy you will not be impressed by the island. It's an average beach.\nThe toilets are not kept in a good condition and on our return boat the max number of people allowed should have been 18, but they took 25.\nAlso, there are stray dogs.\nI really don't recommend coming here. It's not an exceptional experience as they want to sell it.",
        "timeAgo": "2 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjXZHSudMGS2Tw0itIzuHGUK_OshrBhf94gfPHBCzHzE5VxgVZ7s=s128-c0x00000000-cc-rp-mo-ba2",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/103279377566815866109/reviews"
      },
      {
        "author": "shashank agarwal",
        "rating": 5,
        "text": "We visited Île aux Cerfs on Sep 28 after enjoying exciting water activities at Belle Mare Beach in the first half of the day 🏄‍♂️🚤. The island is truly breathtakingly beautiful with crystal-clear blue waters, soft sandy beaches, and lush greenery all around 🌺🌴.\n\nWe had a delicious lunch at one of the beachside restaurants where we ordered veg pizzas, French fries, and refreshing drinks 🍕🍟🥤—everything was tasty and perfectly complemented the beach vibes! After lunch, we clicked lovely photos at several scenic spots 📸😍.\n\nLater, we took a speed boat ride to visit the nearby waterfall, which was another amazing experience 💦🚤. Overall, a memorable and must-visit destination for anyone traveling to Mauritius — ideal for families, couples, and adventure lovers alike! ❤️🇲🇺",
        "timeAgo": "4 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjVI8InS1u66CMXCk7ySVjHGKlWzNajVHx_VkPyiziMvysJZVd-PKQ=s128-c0x00000000-cc-rp-mo-ba6",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/111208676305663756606/reviews"
      }
    ],
    "photos": [
      {
        "url": "/photos/le-aux-cerfs-0.jpg",
        "attribution": "Travel BY IG",
        "width": 4000,
        "height": 3000
      },
      {
        "url": "/photos/le-aux-cerfs-1.jpg",
        "attribution": "Johanna Rolf",
        "width": 4800,
        "height": 3200
      },
      {
        "url": "/photos/le-aux-cerfs-2.jpg",
        "attribution": "Johanna Rolf",
        "width": 4800,
        "height": 3200
      },
      {
        "url": "/photos/le-aux-cerfs-3.jpg",
        "attribution": "The Joori",
        "width": 665,
        "height": 445
      },
      {
        "url": "/photos/le-aux-cerfs-4.jpg",
        "attribution": "Kristina Radojicic",
        "width": 4800,
        "height": 3600
      }
    ]
  },
  "Trou aux Biches Beach": {
    "googleRating": 4.5,
    "totalReviews": 1949,
    "googleMapsUrl": "https://maps.google.com/?cid=9772387968895975276&g_mp=CiVnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLkdldFBsYWNlEAIYBCAA",
    "editorialSummary": "Idyllic palm tree–lined white-sand beach with clear turquoise waters known for snorkeling & sunsets.",
    "reviews": [
      {
        "author": "Milos Lazarevic",
        "rating": 4,
        "text": "Maybe the most beautiful beach on west side of island. In front of resort Beachcomber is the best part, not here where is this pin-it is local parking place with street food. Also, there are few snorkeling spots in front of resort where are pins in the sea - very nice underwater world with lot of different fish..",
        "timeAgo": "2 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjUZ_kHyfXinSGWv6xfE4ZX1_QwSczR1njdUnS77WgTq9q7GczQ=s128-c0x00000000-cc-rp-mo-ba6",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/107706727682062990076/reviews"
      },
      {
        "author": "Henri Kreus",
        "rating": 5,
        "text": "Stunning beach. The sand is so white and cleae that it almost blinds you from the refracted sunlight. It is less local and more resort-y, but still very great and peaceful. The locals are friendly, some might ask you if you are interested in a boat trip etc, but they don’t force it upon you or press the issue, so I don’t see it as a problem. It seems a bit windier than Mont Choisy beach, which makes a bit less peaceful to ”lay down” in the ocean due to a small amount or waves, but this isn’t a problem. Maybe if you have very small children this might be a factor to consider. Still, amazing",
        "timeAgo": "2 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocKt6pSuE66eOgOlmoBH3LwDpXQKoQrDJoRRdRQy5QG191iypQ=s128-c0x00000000-cc-rp-mo-ba3",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/111647541127116825080/reviews"
      },
      {
        "author": "Talitha Snow",
        "rating": 5,
        "text": "Trou aux Biches is a paradise in every sense of the word. Beyond the beauty of the setting, what made our stay unforgettable was the extraordinary service and care from the staff and management team. Every interaction was filled with a warmth and attentiveness that surpassed our expectations.\n\nSpecial thanks to Rambo at the beach bar, who spoiled us with such warmth and generosity. He made every moment by the beach even more special. Our butler Ibrahim went above and beyond to make us feel at home; his attention to detail and kindness truly elevated our stay. The management team made us feel like valued guests at every step, treating us with such attentiveness and care that we left feeling completely spoiled and cherished.\n\nThe food was superb, the hospitality unmatched and the memories we made at Trou aux Biches will stay with us forever. This was an experience we will never forget, and we cannot recommend this hotel highly enough.",
        "timeAgo": "5 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocIMMNCQapOlzsSVE_bDBw8gB58aCXbafQLur9Ea3n0tJx0ahA=s128-c0x00000000-cc-rp-mo",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/112792202765945474923/reviews"
      },
      {
        "author": "Pam Davidson",
        "rating": 4,
        "text": "Beautiful beach with public access. Each beach seems to have a care taker that looks after the toilets and beach area making it very clean. Good car parking area.",
        "timeAgo": "5 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocK13K7irlHj830jk54OR2P75m22zsUwqQztpfPxYZymhlN0gA=s128-c0x00000000-cc-rp-mo-ba3",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/108775139192439877751/reviews"
      },
      {
        "author": "Duncan Allardyce",
        "rating": 5,
        "text": "Favourite snorkel spot, right down the south end (park opposite dive spirit or near popo supermarket). Good variety just off shore, no boat trips necessary. You can swim to where they go in 2 mins. Crowded in the central part of the beach near car park. Wear water shoes  and it's chilly in August",
        "timeAgo": "6 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjUC-GE8PnIynbJ4k6H0HLpjAKybMXoByjGyuA-qJYBrRxhdqwnALg=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/106557169140674206110/reviews"
      }
    ],
    "photos": [
      {
        "url": "/photos/trou-aux-biches-beach-0.jpg",
        "attribution": "Marc Chenut",
        "width": 988,
        "height": 652
      },
      {
        "url": "/photos/trou-aux-biches-beach-1.jpg",
        "attribution": "The Life’s Way",
        "width": 4000,
        "height": 2252
      },
      {
        "url": "/photos/trou-aux-biches-beach-2.jpg",
        "attribution": "Romain WALCH",
        "width": 4000,
        "height": 3000
      },
      {
        "url": "/photos/trou-aux-biches-beach-3.jpg",
        "attribution": "Dylan Pillay04",
        "width": 4032,
        "height": 3024
      },
      {
        "url": "/photos/trou-aux-biches-beach-4.jpg",
        "attribution": "Sascha Bierfreund",
        "width": 1600,
        "height": 900
      }
    ]
  },
  "Flic en Flac Beach": {
    "googleRating": 4.4,
    "totalReviews": 4706,
    "googleMapsUrl": "https://maps.google.com/?cid=11396045033560220501&g_mp=CiVnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLkdldFBsYWNlEAIYBCAA",
    "editorialSummary": "White-sand beach lined with casuarina trees, offering water sports, lagoons & nearby restaurants.",
    "reviews": [
      {
        "author": "Paul Leslie",
        "rating": 5,
        "text": "This beach is not as crowded as some others on Mauritius. There is lots of room and shady areas to sit. The reef is quite far out so the lagoon is very calm.",
        "timeAgo": "a month ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjULznGWonuIkL7d4ft0BrbhIx5XrhpHKZbYP86ncU3mJngAbFIP4Q=s128-c0x00000000-cc-rp-mo-ba6",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/118174995463748934676/reviews"
      },
      {
        "author": "Kashif Abdul Razzaq Misidia",
        "rating": 5,
        "text": "Flic en Flac Beach is beautiful, vibrant, and full of energy.\nI visited and immediately felt I should have come here earlier. The experience was different from other beaches in Mauritius.\n\nI came from Rose Hill on the UBS bus. It took around 45 minutes because of traffic. The return trip took longer, but the ride was still fine.\n\nThe beach looked clean. The overall care for the coastline impressed me. Many places can learn from this level of maintenance. You get some of the best views on the island here. The water is crystal clear. The sunsets are stunning. The area feels positive and welcoming.\nThe beach was more crowded than other spots I visited. It added to the lively atmosphere. Tourists and locals were enjoying their time.\n\nI also noticed good ♿ accessibility arrangements.🅿️♿ Accessible car parking was visible right at the entrance.\n\nIf you want a clean beach with great views and a lively scene, Flic en Flac is a strong choice.",
        "timeAgo": "2 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjXLdyxbpZDEOJAgX8KYUk6ToGCyq-8TU7xbM_IB3u0oYxfX_mCWyA=s128-c0x00000000-cc-rp-mo-ba8",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/113453064043300985454/reviews"
      },
      {
        "author": "Nikhil Patil",
        "rating": 5,
        "text": "Undoubtedly one of the most famous beaches of Mauritius.\nThe beach although crowded but has enough space to walk around and feels calm as well.\nThere are multiple eatery options at the beach as well as on the opposite side of the road.\nParking is ample.",
        "timeAgo": "3 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjX3CRELPY0bDluywHM2HzZdIpIvAiw0NlZcNa3fy8qT16sX1ZFHqA=s128-c0x00000000-cc-rp-mo-ba7",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/106446297904692483557/reviews"
      },
      {
        "author": "Ashish Kamatala",
        "rating": 5,
        "text": "Visited Flic en Flac Beach in the evening and got to witness one of the most beautiful sunsets in Mauritius. The golden light reflecting on the calm waters, with the horizon slowly turning shades of orange and pink, was simply magical.\n\nThe beach itself is long, clean, and perfect for a relaxing stroll. The atmosphere was peaceful, with a gentle breeze and the sound of waves creating the perfect setting to unwind.\n\nA must-visit if you’re in Mauritius — especially in the evening for a picture-perfect sunset experience.",
        "timeAgo": "6 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjUx8Q_NQJjH_Qk8JofXaocLAECJ1HssdyzuVGSkvx5WPoy78zV4=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/109629800499269721896/reviews"
      },
      {
        "author": "Lee E",
        "rating": 5,
        "text": "Beautiful long white sandy beach with calm waters most of the time. Get some water shoes as a lot of coral",
        "timeAgo": "3 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjXnEJuqztwltCJSNwp9-tvUkYrFJ4GL-JjTV-k0D1GhalnG8n8=s128-c0x00000000-cc-rp-mo-ba5",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/111305861622508142061/reviews"
      }
    ],
    "photos": [
      {
        "url": "/photos/flic-en-flac-beach-0.jpg",
        "attribution": "Katya Vttk",
        "width": 4064,
        "height": 3048
      },
      {
        "url": "/photos/flic-en-flac-beach-1.jpg",
        "attribution": "Love Food & Travel",
        "width": 4032,
        "height": 2268
      },
      {
        "url": "/photos/flic-en-flac-beach-2.jpg",
        "attribution": "Richard Toth",
        "width": 1600,
        "height": 1200
      },
      {
        "url": "/photos/flic-en-flac-beach-3.jpg",
        "attribution": "Michael Kauertz",
        "width": 4032,
        "height": 3024
      },
      {
        "url": "/photos/flic-en-flac-beach-4.jpg",
        "attribution": "Anna F",
        "width": 4032,
        "height": 3024
      }
    ]
  },
  "Blue Bay Marine Park": {
    "googleRating": 4.5,
    "totalReviews": 1654,
    "googleMapsUrl": "https://maps.google.com/?cid=7366073119097956327&g_mp=CiVnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLkdldFBsYWNlEAIYBCAA",
    "editorialSummary": "Ocean preserve featuring a coral garden teeming with fish, sea turtles & glass bottom–boat rides.",
    "reviews": [
      {
        "author": "Samo",
        "rating": 5,
        "text": "Blue Marine Bay is hands down one of the most beautiful and peaceful coastal spots in Mauritius. The shoreline here is absolutely stunning clear turquoise waters, gentle waves, and a calm, laid-back vibe that’s perfect for relaxing or exploring the sea.\nWhat really makes this spot special is the snorkeling.\nYou can easily rent a boat to take you near the corals and beautiful spots with colorful varieties of Fish.\n\nThe waters are incredibly clear, making it easy to see the vibrant marine life just below the surface. From colorful coral to schools of tropical fish, every swim feels like stepping into a natural aquarium. You don’t even have to go far from shore just a few meters in, and you’re surrounded by beauty.\n\nJust one advice check the weather before you plan to visit the marine as more calmer the waves more clearer the marine life.",
        "timeAgo": "5 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjV2vIUWif1bffOr6HF5AqGjpPdqelRfU4_k_f6x31U87MKrNQ=s128-c0x00000000-cc-rp-mo-ba5",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/113674809886796809919/reviews"
      },
      {
        "author": "Gizem Cankaya",
        "rating": 5,
        "text": "It was very beatiful I highly recommend to make snorkelling. Very beatiful underwater views you will see , corols, lots of colored fishes 🐠🪸",
        "timeAgo": "3 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjXBOdxffnxHJTLeiMHtUgtSyAI3hhseZKsfjswaf9HjjNzc0Cg=s128-c0x00000000-cc-rp-mo-ba3",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/101541680375019807842/reviews"
      },
      {
        "author": "Donovan Smith",
        "rating": 4,
        "text": "The sea is a beautiful colour\nWe went out in one amongst many other glass bottom boats to a decent spot with plenty of colourful fish for snorkelling. Definitely worth a visit.  Google maps led us a bit awry.",
        "timeAgo": "4 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocImEw94pR3v_4tDTnoCHu55noiSfqe2C7XiIsnJ0uj9yVIPsA=s128-c0x00000000-cc-rp-mo-ba3",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/108865823105702845583/reviews"
      },
      {
        "author": "Faryal Sacoor",
        "rating": 5,
        "text": "It’s a secluded island we visited on a day trip to L’ile des Deux Coco. The perfect sunny weather during September month with beautiful views, blue waters and snorkelling to see the beautiful marine underwater. We were also treated with a scrumptious buffet which included various meat, veg and seafood options",
        "timeAgo": "5 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjUVcmR7Whu5wzfKJ2CyTE7tnHJH9867LZHEddb0_O9VTEY-e2BMlA=s128-c0x00000000-cc-rp-mo-ba5",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/107608065010074301806/reviews"
      },
      {
        "author": "Paulomi Roy",
        "rating": 5,
        "text": "A stunning beach with incredible azure waters, but sadly, most of the corals are dead or sick due to pollution and global warming. We snorkeled and saw a variety of fish, but it was heartbreaking to see their shelters, once vibrant corals, now lifeless. Despite this, the beach and bay remain breathtakingly beautiful.",
        "timeAgo": "a year ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjU2gwRhjbCpjJqV2Io0-JGnroFwzk55SVA9KOpdg-5SKKHvHESggg=s128-c0x00000000-cc-rp-mo-ba6",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/102086610023743998202/reviews"
      }
    ],
    "photos": [
      {
        "url": "/photos/blue-bay-marine-park-0.jpg",
        "attribution": "Andy Sabapathee",
        "width": 4618,
        "height": 3464
      },
      {
        "url": "/photos/blue-bay-marine-park-1.jpg",
        "attribution": "Thomas Weggel",
        "width": 4000,
        "height": 3000
      },
      {
        "url": "/photos/blue-bay-marine-park-2.jpg",
        "attribution": "Amrit Aditya",
        "width": 4032,
        "height": 3024
      },
      {
        "url": "/photos/blue-bay-marine-park-3.jpg",
        "attribution": "Marius Kiss",
        "width": 4000,
        "height": 3000
      },
      {
        "url": "/photos/blue-bay-marine-park-4.jpg",
        "attribution": "Tawsiq Jamal",
        "width": 4032,
        "height": 3024
      }
    ]
  },
  "Le Morne Beach": {
    "googleRating": 4.6,
    "totalReviews": 2415,
    "googleMapsUrl": "https://maps.google.com/?cid=1151425708460786091&g_mp=CiVnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLkdldFBsYWNlEAIYBCAA",
    "reviews": [
      {
        "author": "Mariam",
        "rating": 5,
        "text": "The beach is a truly beautiful with crystal clear water. There are no sunbeds or umbrellas, so just bring your own beach towel and enjoy the natural vibe. It’s peaceful, unspoiled, and perfect for a relaxing day by the sea. Spending a day here during your trip is absolutely worth it. 🌊✨",
        "timeAgo": "a week ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjVxQR6OCR6EbLqunjAWwmWAdRElcjUbVtEcO4x79ueUoHBTIBU=s128-c0x00000000-cc-rp-mo-ba3",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/105407017051569818276/reviews"
      },
      {
        "author": "Moc An",
        "rating": 5,
        "text": "I love this beach! So amazing and peaceful ❤️❤️❤️ my number one beach in Mauritius so far. If you come earlier, you'd have the whole beautiful beach for yourself. Le Morne is also quite popular for water sports too, so much fun watching them or try out if you like. And if you are looking for a nice beach to go snorkeling, it's the one 🥰🏖️",
        "timeAgo": "2 weeks ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjWY4AmFT7xiEDO9-C6ZX7OasTRYcGIghpQNma6LA2K3qLurBkkI=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/109170692522968438658/reviews"
      },
      {
        "author": "Cinderella Indie",
        "rating": 5,
        "text": "Le Morne Public Beach – Perfect for a Relaxing Beach Day\n\nLe Morne Public Beach is absolutely beautiful, with soft white sand and crystal-clear blue water. Everything you’d want for a lazy, relaxing beach day is right here.\n\nThe beach is well equipped with plenty of free parking, public toilets, and a beverage stall, making it very convenient for visitors. It’s a great place to unwind, swim, or simply enjoy the peaceful surroundings.\n\nNearby, there are three luxury hotels. Unfortunately, they do not allow outside guests to dine in, which is something to keep in mind if you were hoping to visit the restaurants.\n\nOverall, a lovely public beach with great facilities and stunning scenery — definitely worth a visit. 🌊✨",
        "timeAgo": "a month ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjXqU0v1jtbchkiG5fcxJjsbSLywPUKDvExmHo0v9ZS4ybumHg8=s128-c0x00000000-cc-rp-mo-ba6",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/115154969156130905844/reviews"
      },
      {
        "author": "Frankie A",
        "rating": 5,
        "text": "Le Morne Public Beach is a beautiful and relaxing spot, perfect for spending the day by the ocean. The beach is clean, spacious, and offers stunning views of Le Morne Brabant in the background. Parking is convenient, with public parking available nearby during daytime hours, making access easy for visitors.\n\nOne of the highlights is the sunset — absolutely spectacular. As the sun dips behind the mountain and ocean, the sky fills with incredible colors, making it a perfect spot for photos or a peaceful evening walk. Highly recommended if you’re visiting the area and want to experience one of Mauritius’s most scenic beaches.",
        "timeAgo": "3 weeks ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjVdcTdeay97oDOtCOMOJtMUFlY6f-5-RmAFUatPOQ6cbE87AkYv=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/115669476817196590054/reviews"
      },
      {
        "author": "Milos Lazarevic",
        "rating": 2,
        "text": "There is a plenty of parking on public parking, pass the grass and the beach is there. But, do not expect something remarkable. Lots of dead corals along the beach and also big stones in shallow water. The most valuable is the view from resort to Le Morne mountain..",
        "timeAgo": "2 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjUZ_kHyfXinSGWv6xfE4ZX1_QwSczR1njdUnS77WgTq9q7GczQ=s128-c0x00000000-cc-rp-mo-ba6",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/107706727682062990076/reviews"
      }
    ],
    "photos": [
      {
        "url": "/photos/le-morne-beach-0.jpg",
        "attribution": "ABDEL KHAN",
        "width": 1080,
        "height": 1017
      },
      {
        "url": "/photos/le-morne-beach-1.jpg",
        "attribution": "shamsan alammari",
        "width": 736,
        "height": 460
      },
      {
        "url": "/photos/le-morne-beach-2.jpg",
        "attribution": "Gustava Klimt -kinga-",
        "width": 3859,
        "height": 2894
      },
      {
        "url": "/photos/le-morne-beach-3.jpg",
        "attribution": "Tristan Annet",
        "width": 3024,
        "height": 4032
      },
      {
        "url": "/photos/le-morne-beach-4.jpg",
        "attribution": "Virginie et Fred",
        "width": 4032,
        "height": 3024
      }
    ]
  },
  "Crystal Rock": {
    "googleRating": 4.6,
    "totalReviews": 337,
    "googleMapsUrl": "https://maps.google.com/?cid=1208879837143061876&g_mp=CiVnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLkdldFBsYWNlEAIYBCAA",
    "reviews": [
      {
        "author": "Jignesh Pathak",
        "rating": 4,
        "text": "Wonderful formation of rock over the turquoise green water.... dolphine watching and to sail along with  is a thrilling experience . one can do scuba diving or snorkeling with this amazing creature.",
        "timeAgo": "5 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjWtHcfl_qFbLDJfsmYgMqYPst-L6DZK90089kd9nPjC5u4giYTdzg=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/114332019000380041982/reviews"
      },
      {
        "author": "Jubber Sukhinöva",
        "rating": 5,
        "text": "Amazing place! The water is soo clear! We enjoyed swimming and snorkeling near the Crystal Rock.",
        "timeAgo": "6 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocIPy9JfBrF_Rmy0TRRAr6CN3Ofst_K8KVSHxN-XLGw9P_gjLQ=s128-c0x00000000-cc-rp-mo-ba3",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/113890912582536826087/reviews"
      },
      {
        "author": "Michael Fuerst",
        "rating": 5,
        "text": "Hot spot for water sports enthusiasts!\nOnly approachable by boat you will find a great place to look at and swim around. The water isn’t that deep that you even can touch the sea ground. It’s not allowed to climb onto the rock however swim and dive around. If you touch the rock, you can make a wish come true. There is plenty of sea life however be careful with the current and be cautious because of sea urchins. It’s recommended to wear bathing shoes.",
        "timeAgo": "a year ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocJW1aU5LQe8QSZ6z8Utx4btfqcigruWkhjColpmTuwglVnFsA=s128-c0x00000000-cc-rp-mo-ba6",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/112546954443693206818/reviews"
      },
      {
        "author": "Billy Long",
        "rating": 4,
        "text": "Unusual rock located in the middle of the sea off Le Morne island. You need a boat to see it clearly.",
        "timeAgo": "2 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjWSooI1x03ylpg-3VWvyZxuVCRMeOauadB6gmlEPbZdytqJ40wM=s128-c0x00000000-cc-rp-mo-ba5",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/100784909727733471789/reviews"
      },
      {
        "author": "H Choolun",
        "rating": 4,
        "text": "The water is transparent and shallow. Very good for snorkelling and swimming. I love this view!!!",
        "timeAgo": "7 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocIUwftFbIaOkhULTRLJ4UZc6OkAiFoGD531_lPQDAUxUSwvzQ=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/110911916243108860369/reviews"
      }
    ],
    "photos": [
      {
        "url": "/photos/crystal-rock-0.jpg",
        "attribution": "Crystal Rock",
        "width": 1080,
        "height": 838
      },
      {
        "url": "/photos/crystal-rock-1.jpg",
        "attribution": "Ravish",
        "width": 696,
        "height": 588
      },
      {
        "url": "/photos/crystal-rock-2.jpg",
        "attribution": "Ignacio Bartolomesanz",
        "width": 4624,
        "height": 3472
      },
      {
        "url": "/photos/crystal-rock-3.jpg",
        "attribution": "Vijay Sanassy",
        "width": 3024,
        "height": 4032
      },
      {
        "url": "/photos/crystal-rock-4.jpg",
        "attribution": "Luca Molon",
        "width": 4032,
        "height": 3024
      }
    ]
  },
  "Île aux Aigrettes": {
    "googleRating": 4.7,
    "totalReviews": 214,
    "googleMapsUrl": "https://maps.google.com/?cid=3582806101153928640&g_mp=CiVnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLkdldFBsYWNlEAIYBCAA",
    "editorialSummary": "Compact island offering tours of its nature sanctuary, home to endangered wildlife & rare plants.",
    "reviews": [
      {
        "author": "Henning Thunes",
        "rating": 5,
        "text": "This trip should be on top of any todo list of things to do in Mauritius.\n\nOur guide was passionate about the work being done on the island, she possessed excellent knowledge of its history, and clearly explained how everything in the island's ecosystem is connected.  All this included with a good sense of humor made this a very good tour.",
        "timeAgo": "a month ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjXLGoe5jTOKpYb2ag8S1JPmxNPx5RIu844nGOTSBX1LB92DjS3M=s128-c0x00000000-cc-rp-mo",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/105747403932125402016/reviews"
      },
      {
        "author": "Jason Brasier",
        "rating": 5,
        "text": "What a joy to come to this nature reserve and see so many endemic species, including the pink pigeon and Mauritian white eyes! We also met so many giant tortoises and got closer than you can imagine.\n\nThe wildlife foundation guide who conducted our tour was informative, passionate, and incredibly knowledgable. It was great to contribute to this institution with the tour, and not a bad price either.\n\nMake sure you bring lots of water and insect spray.",
        "timeAgo": "a week ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocIMdDXqXS9nLDl2payVph0DFymCEkmmm5jv0WRClSyT93ey=s128-c0x00000000-cc-rp-mo",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/111985144175644535048/reviews"
      },
      {
        "author": "Som Montree",
        "rating": 5,
        "text": "The Island is small but it was a great experience seeing a big tortoise walking freely in the forest. We’ve seen a rare pink pigeon and orchids. Such a pity there are many party boats docking on the island shore and the music was so loud, really annoying.",
        "timeAgo": "a year ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjWNPsmQKIkcLD3ucdH-uzneAzuetqPP_eysW301LCF47KFspDE9lw=s128-c0x00000000-cc-rp-mo-ba6",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/105095280956723751075/reviews"
      },
      {
        "author": "Sophie M",
        "rating": 5,
        "text": "A nice 1.5-hour tour to do if you have some time!\n\nWe booked our tickets online and were warmly welcomed by the staff the following day. Our tour guide was lovely and engaging.",
        "timeAgo": "a year ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjV_vUgn1iuI96Ppt-DcjZTOTB99OVD0n5nUlPJf5of01vmZwdZOqA=s128-c0x00000000-cc-rp-mo-ba5",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/116861967363312372097/reviews"
      },
      {
        "author": "Marian Mandrea",
        "rating": 5,
        "text": "Amazing place to visit with the Mauritian wildlife Foundation here. There is an animal sanctuary to be visited with lots of tortoises and reptiles. Please make sure you have a mosquito repellent because there are a lot of mosquitoes here.",
        "timeAgo": "6 years ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjUkMoJ_wP5AS28Yx06uORU4dZC6kw6_S2oh9ARuw1wa1o9rHnMY7A=s128-c0x00000000-cc-rp-mo-ba5",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/116992290257872193135/reviews"
      }
    ],
    "photos": [
      {
        "url": "/photos/le-aux-aigrettes-0.jpg",
        "attribution": "Sheila K",
        "width": 960,
        "height": 720
      },
      {
        "url": "/photos/le-aux-aigrettes-1.jpg",
        "attribution": "Tej Nisha",
        "width": 4000,
        "height": 3000
      },
      {
        "url": "/photos/le-aux-aigrettes-2.jpg",
        "attribution": "Ivo Klimeš",
        "width": 3024,
        "height": 4032
      },
      {
        "url": "/photos/le-aux-aigrettes-3.jpg",
        "attribution": "Som Montree",
        "width": 4800,
        "height": 3600
      },
      {
        "url": "/photos/le-aux-aigrettes-4.jpg",
        "attribution": "Kaspar S",
        "width": 4032,
        "height": 3024
      }
    ]
  },
  "Port Louis Central Market": {
    "googleRating": 4,
    "totalReviews": 11114,
    "googleMapsUrl": "https://maps.google.com/?cid=93661475342135607&g_mp=CiVnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLkdldFBsYWNlEAIYBCAA",
    "editorialSummary": "Traditional market for fruit, vegetables & souvenirs plus Chinese herbal medicines & aphrodisiacs.",
    "reviews": [
      {
        "author": "Kashif Abdul Razzaq Misidia",
        "rating": 5,
        "text": "This was my first time visiting this part of Port Louis, and this market truly surprised me.\nYou can buy groceries, meat, vegetables, souvenirs, or dresses. This market meets all your needs.\nSome parts of the market are ♿wheelchair accessible, while some areas have steps that can create difficulty for wheelchair users.\nThe first floor has many souvenirs available at good prices.\nThere is also a souvenirs market right in front of this place where you can buy T shirts, fridge magnets, caps, and many other items.\nI liked the vegetables and fruit market the most because I saw all the fruits and vegetables extremely fresh and of good quality.\nIf you are in Mauritius 🇲🇺, you should definitely visit this market.",
        "timeAgo": "2 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjXLdyxbpZDEOJAgX8KYUk6ToGCyq-8TU7xbM_IB3u0oYxfX_mCWyA=s128-c0x00000000-cc-rp-mo-ba8",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/113453064043300985454/reviews"
      },
      {
        "author": "Žaneta Szipinová",
        "rating": 4,
        "text": "If you want to enjoy the atmosphere of a classic market, you've come to the right place. You'll find fresh fruit, vegetables, fish, meat, and you'll definitely get a good price for your holiday souvenirs. And even shopaholics will find something to their liking here.",
        "timeAgo": "3 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjXMorpauESOWUu3xKCXWK3M9fTX2bOejCXdvuY3gMU1dulbDR7n=s128-c0x00000000-cc-rp-mo-ba3",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/105698952254595938443/reviews"
      },
      {
        "author": "ilona Horvath",
        "rating": 3,
        "text": "Meat, poultry and fish on one side, this market finds its origins 300 years ago. The fruit and veg market is fascinating. That's also where you'll find the \"food court\" and, up the stairs, the souvenirs shops. Take a look around and compare prices. Its eerie and particular.",
        "timeAgo": "2 weeks ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjUXyTedU5ZaEmSXZrRZLJvV1bH_Xda6cknNi-6CGRIWGrbEVhTbXA=s128-c0x00000000-cc-rp-mo-ba5",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/118254900538865091271/reviews"
      },
      {
        "author": "O and N",
        "rating": 3,
        "text": "Overpriced market but still nice to experience and to visit. Port Louis is the home of the largest market, where you can find fresh food items, local dishes, and various handcrafted goods that are useful to locals and serve as souvenirs for tourists. It is always crowded, even during weekdays, as many locals working in Port Louis stop by for a cheap snack. You can find fresh meat, poultry, fish and seafood, as well as veggies, fruits and spices. You can also buy many handcrafted souvenirs and gifts, but keep in mind you must bargain all the time. It's also one of the best places for local street food.",
        "timeAgo": "6 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjU4YfAelZyB4PHv9y5WgPp3opmgXkxSI3gu_m9DDt4RE6RYVEM=s128-c0x00000000-cc-rp-mo-ba6",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/113118582898167722953/reviews"
      },
      {
        "author": "Allen M Group",
        "rating": 5,
        "text": "Loved the food here good place to buy your souvenirs please try Alouda Pillay refer to the pic to find the correct stall. Again when you speak English you get charged more try your best to speak French or check the prices so you know when they robbing you",
        "timeAgo": "5 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjU1oVnHIdQ47_S9YwkLcE6t6yq355BcrmB3Gv-w25Zh4Spos7k=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/100330152330006606328/reviews"
      }
    ],
    "photos": [
      {
        "url": "/photos/port-louis-central-market-0.jpg",
        "attribution": "Bianka Seibt",
        "width": 3000,
        "height": 4000
      },
      {
        "url": "/photos/port-louis-central-market-1.jpg",
        "attribution": "zvjezdana boric",
        "width": 4096,
        "height": 3072
      },
      {
        "url": "/photos/port-louis-central-market-2.jpg",
        "attribution": "Priscilla Surfraz",
        "width": 4000,
        "height": 3000
      },
      {
        "url": "/photos/port-louis-central-market-3.jpg",
        "attribution": "My - Happy - Space",
        "width": 3024,
        "height": 4032
      },
      {
        "url": "/photos/port-louis-central-market-4.jpg",
        "attribution": "Richard Philips",
        "width": 4000,
        "height": 2250
      }
    ]
  },
  "Caudan Waterfront": {
    "googleRating": 4.3,
    "totalReviews": 8183,
    "googleMapsUrl": "https://maps.google.com/?cid=15064681629939720786&g_mp=CiVnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLkdldFBsYWNlEAIYBCAA",
    "editorialSummary": "Waterfront mall featuring local boutiques, a food court, a cinema & local arts & crafts vendors.",
    "reviews": [
      {
        "author": "Kashif Abdul Razzaq Misidia",
        "rating": 5,
        "text": "This is a very beautiful place where you can enjoy a calm and relaxing evening.\nThe clear water, the ships standing in the harbor, and the buildings around it make the view even more attractive.\n\nLe Caudan Waterfront is one of the most popular commercial spots in Port Louis. You get shopping, banks, restaurants, a cinema, a casino and a marina in one place.There is also a five star hotel.\nIt was the first shopping mall in Mauritius, and it still stays popular because of its modern style.\n\nYou also find a bronze statue of Sir Seewoosagur Ramgoolam here.\nNearby at Place Mahe de Labourdonnais there is a statue of Governor Mahe de Labourdonnais, which is part of the same complex.\n\nI spent great time here with my friend.\nAfter that we walked to the beautiful street decorated with colorful ☔ umbrellas, which created a very charming scene.\n\nThe best part for me was the good ♿🧑🏼‍🦯👩🏼‍🦯accessibility.\nWheelchair users and other differently abled persons can move around this area with ease.",
        "timeAgo": "2 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjXLdyxbpZDEOJAgX8KYUk6ToGCyq-8TU7xbM_IB3u0oYxfX_mCWyA=s128-c0x00000000-cc-rp-mo-ba8",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/113453064043300985454/reviews"
      },
      {
        "author": "Martin Rapier",
        "rating": 4,
        "text": "Touristy water front development down by the port in Port Louis.\n\nIt is well done and very pleasant to wander around the (air conditioned!) shops. It is also very close to the aquarium, which is a short walk away.\n\nPretty much what you'd expect, a mix of high end shops, artisanal stuff and souvenirs.",
        "timeAgo": "2 weeks ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjWBXtgILb3HJR_L_BdTQmsYXIQR3KCUqqGZJOXv_5VVKZJ1UBq3eQ=s128-c0x00000000-cc-rp-mo-ba6",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/112871031347151350216/reviews"
      },
      {
        "author": "Nikhil Patil",
        "rating": 5,
        "text": "The most vibrant and happening place in Port Louis. The entire area is filled with hustle and bustle. Ample eatery options. For cheaper food options you can visit the nearby central market.\nThere are paid parking facilities as well.",
        "timeAgo": "3 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjX3CRELPY0bDluywHM2HzZdIpIvAiw0NlZcNa3fy8qT16sX1ZFHqA=s128-c0x00000000-cc-rp-mo-ba7",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/106446297904692483557/reviews"
      },
      {
        "author": "jian gu",
        "rating": 5,
        "text": "Very modern and busy commercial area in the capital city of Mauritius Port Louise. A lot of brand- shops, mingled with local gift shops, art center and restaurants. Stone bridges connect the parts of the area. Half a day is the typical time to spend here.",
        "timeAgo": "2 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjV_-q_9YqZGVjaTqsFE-YAY1LFqUYWSGCG6we5Ruz12LB_KgAXO9A=s128-c0x00000000-cc-rp-mo-ba7",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/117587585299306542775/reviews"
      },
      {
        "author": "Dhouha Ben Mrad",
        "rating": 4,
        "text": "with an easy access its always decorated with any event I found the food festival it was a great event .there are a lot of shops and restaurants with a beautiful view on the sea . some museum  are so near to each others.",
        "timeAgo": "2 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjW4Xkw8DLzuevUUqpylsk79Y5F2Zp349gqHTEXe6PIS5JgUGlQ=s128-c0x00000000-cc-rp-mo-ba5",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/108622970828286351935/reviews"
      }
    ],
    "photos": [
      {
        "url": "/photos/caudan-waterfront-0.jpg",
        "attribution": "Caudan Waterfront",
        "width": 2250,
        "height": 1502
      },
      {
        "url": "/photos/caudan-waterfront-1.jpg",
        "attribution": "Caudan Waterfront",
        "width": 2250,
        "height": 1502
      },
      {
        "url": "/photos/caudan-waterfront-2.jpg",
        "attribution": "ra Pha",
        "width": 4032,
        "height": 3024
      },
      {
        "url": "/photos/caudan-waterfront-3.jpg",
        "attribution": "Caudan Waterfront",
        "width": 4800,
        "height": 3199
      },
      {
        "url": "/photos/caudan-waterfront-4.jpg",
        "attribution": "Nic1809 Nicholas",
        "width": 4000,
        "height": 3000
      }
    ]
  },
  "Aapravasi Ghat (UNESCO)": {
    "googleRating": 4.5,
    "totalReviews": 967,
    "googleMapsUrl": "https://maps.google.com/?cid=2432031886419830476&g_mp=CiVnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLkdldFBsYWNlEAIYBCAA",
    "editorialSummary": "Former immigration depot for indentured labour from India, now home to an Interpretation Centre.",
    "reviews": [
      {
        "author": "Bhaskar",
        "rating": 5,
        "text": "Aapravasi Ghat is a very powerful and meaningful place to visit in Mauritius. It gives deep insight into the history of indentured labour and how Indians, especially Hindus, came to Mauritius and built their lives here.\nYou get to understand how people lived, worked, and struggled during those times, and how their culture, traditions, and values still shape Mauritius today. The information is well presented and really makes you appreciate the sacrifices of our ancestors.\nA must-visit World Heritage Site for anyone who wants to truly understand the history of Mauritius, not just see tourist attractions. Highly recommended.",
        "timeAgo": "a month ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjWzNTJ5xb_-GrDdqT1JrWC61EFuOa-QRedQbsEpaeo3eG9_MH0D=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/103688812554018777313/reviews"
      },
      {
        "author": "Kyras Sunghuttee",
        "rating": 5,
        "text": "Really well done exhibit to accompany the heritage site.\n\nIt tells the story of the \"great experiment\" to use indentured labour after slavery was abolished and the conditions that these labours worked under.\n\nWould recommend anyone to visit for an hour, but especially Mauritians.\n\nPlus, it's free entry.",
        "timeAgo": "3 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjUEjJs70XnWbONfPmGk2Y3BkzOwNsySmFCcExSQK6O3bRWD_fo=s128-c0x00000000-cc-rp-mo-ba5",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/111168428560295515642/reviews"
      },
      {
        "author": "Ameya A Gaandhe",
        "rating": 5,
        "text": "Significant, place to learn about Mauritius & how culture has been shaped due to Slavery in the past. Lots of details photographs & historical articles that anyone can take a look. Located on the bay of Trou Fanfaron, in the capital of Port-Louis, the Aapravasi Ghat is the remains of an immigration depot, the site from where modern indentured labour Diaspora emerged.",
        "timeAgo": "4 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjXvu-VJUWz14AEZTTA_xDsvBILoOzAAX5P-utBvr5wavB6tYQ7m=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/117472403386811784928/reviews"
      },
      {
        "author": "Paul Leslie",
        "rating": 5,
        "text": "Amazing experience. The displays are very well done and the story being told is epic. Highly recommended as a destination in Port Louis and in Mauritius.",
        "timeAgo": "a month ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjULznGWonuIkL7d4ft0BrbhIx5XrhpHKZbYP86ncU3mJngAbFIP4Q=s128-c0x00000000-cc-rp-mo-ba6",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/118174995463748934676/reviews"
      },
      {
        "author": "Dipanjan Roychoudhary",
        "rating": 5,
        "text": "A quiet place for reflection and pondering upon history and our ancestors who came so far in search of work on the sugarcane fields, a unesco world heritage site - it’s maintained very well",
        "timeAgo": "5 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjXCZNKoHKFQpocuJtVFYC2rz7PJoR7nXk9fX35g8qlTOn1XG5Qv=s128-c0x00000000-cc-rp-mo-ba5",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/100624377511877009329/reviews"
      }
    ],
    "photos": [
      {
        "url": "/photos/aapravasi-ghat-unesco-0.jpg",
        "attribution": "Aleksandr",
        "width": 4000,
        "height": 3000
      },
      {
        "url": "/photos/aapravasi-ghat-unesco-1.jpg",
        "attribution": "Ludo Miny",
        "width": 2268,
        "height": 4032
      },
      {
        "url": "/photos/aapravasi-ghat-unesco-2.jpg",
        "attribution": "Karl de Boois",
        "width": 4800,
        "height": 2701
      },
      {
        "url": "/photos/aapravasi-ghat-unesco-3.jpg",
        "attribution": "N M",
        "width": 4032,
        "height": 3024
      },
      {
        "url": "/photos/aapravasi-ghat-unesco-4.jpg",
        "attribution": "Manoj Sharma",
        "width": 4032,
        "height": 3024
      }
    ]
  },
  "Cap Malheureux Church": {
    "googleRating": 4.6,
    "totalReviews": 4808,
    "googleMapsUrl": "https://maps.google.com/?cid=15513762636178040156&g_mp=CiVnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLkdldFBsYWNlEAIYBCAA",
    "reviews": [
      {
        "author": "Stephanie Hall",
        "rating": 5,
        "text": "Such a special, beautiful church on the beach to visit...the lovely energy is tangible here. Sit under the trees a few steps away from the shore and enjoy a meal at an open air restaurant. Long pier to take beautiful photos. The beach is ideal for swimming. There's a swing under the tree at the open air restaurant and little curios shops on the beach with stunning jewelry and momentos. Well worth a visit. It's super hot in summer so take sun protection.",
        "timeAgo": "a month ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjV5n9Jps_VzV9p51HEOhmBxn1cg9UiYKQVyrHAIZEHA0S4jJQz7oA=s128-c0x00000000-cc-rp-mo-ba3",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/110292969197564409143/reviews"
      },
      {
        "author": "ilona Horvath",
        "rating": 5,
        "text": "Beautiful church, with lots of History. Please respect this place of worship when visiting : I had to witness people in absolutely indecent clothing walk in. It's as cute as it is on all the photos. It's right next to a lovely beach with food trucks.",
        "timeAgo": "2 weeks ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjUXyTedU5ZaEmSXZrRZLJvV1bH_Xda6cknNi-6CGRIWGrbEVhTbXA=s128-c0x00000000-cc-rp-mo-ba5",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/118254900538865091271/reviews"
      },
      {
        "author": "WCS Bakery Supply Services",
        "rating": 5,
        "text": "Fantastic holiday destination! The villa is exceptionally well equipped and perfectly located, with restaurants and shopping just a short distance away. We truly loved our stay during the December holidays",
        "timeAgo": "a month ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjWrmnMzbdV-cAixtCtu2N55ewrah1hP7ASCFbTMZIOO95V3aOaT=s128-c0x00000000-cc-rp-mo-ba3",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/112097361364335397401/reviews"
      },
      {
        "author": "jian gu",
        "rating": 5,
        "text": "Very beautiful wood-structured church, located near the northern tip of Mauritius island. Iconic, because of its eye-catching red roof and two identical pinnacles. A lot of people go for this place due to its fame. Finding a parking spot nearby could be a bit challenging.",
        "timeAgo": "2 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjV_-q_9YqZGVjaTqsFE-YAY1LFqUYWSGCG6we5Ruz12LB_KgAXO9A=s128-c0x00000000-cc-rp-mo-ba7",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/117587585299306542775/reviews"
      },
      {
        "author": "Julie Dow",
        "rating": 5,
        "text": "There was a wedding taking place here today and how lovely, very pretty church and beautiful views. With public BBQ right next door. The beach is rocky but stunning",
        "timeAgo": "3 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjUfnAvah0ft-vn53bwFC_gLSAOHsgBrBRQ_TCNIvcvjlfXX3X1a=s128-c0x00000000-cc-rp-mo-ba5",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/107682262339679086569/reviews"
      }
    ],
    "photos": [
      {
        "url": "/photos/cap-malheureux-church-0.jpg",
        "attribution": "Tobi Stark",
        "width": 3600,
        "height": 4800
      },
      {
        "url": "/photos/cap-malheureux-church-1.jpg",
        "attribution": "Julien Grossaulle",
        "width": 4800,
        "height": 3600
      },
      {
        "url": "/photos/cap-malheureux-church-2.jpg",
        "attribution": "Janusz Dylewski",
        "width": 3024,
        "height": 4032
      },
      {
        "url": "/photos/cap-malheureux-church-3.jpg",
        "attribution": "Nicolas Parisot",
        "width": 3000,
        "height": 4000
      },
      {
        "url": "/photos/cap-malheureux-church-4.jpg",
        "attribution": "Aleksandr Kondratev",
        "width": 3000,
        "height": 4000
      }
    ]
  },
  "Pamplemousses Botanical Garden": {
    "googleRating": 4.3,
    "totalReviews": 13552,
    "googleMapsUrl": "https://maps.google.com/?cid=12903162337128428707&g_mp=CiVnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLkdldFBsYWNlEAIYBCAA",
    "editorialSummary": "18th-century botanical gardens with 500 plant species including giant water lilies & Talipot palm.",
    "reviews": [
      {
        "author": "Vrishan Seesunkur",
        "rating": 4,
        "text": "As a local, I have visited the Botanical Garden many times and I am always impressed by its grandeur. The layout is perfect for a fully immersive experience, making it a great place to relax and take a moment. The variety of plants and trees is amazing, and the giant water lilies are definitely the stars of the garden. The giant climbing monsters also make their presence known on the trees. It is a garden worth seeing.\n\nEntry price: Local – Rs 25, Non-Resident – Rs 300.\n\nYou can hire a guide on site for Rs 75 per person, which is worth it. Some spots have been a bit neglected, but it doesn’t really affect the experience. I wasn’t a fan of the deer pen, as the animals looked miserable.\n\nLeave a good 2 hours to complete the tour.\n\nDon’t forget mosquito spray, it can get serious there",
        "timeAgo": "a month ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjVlUmd36IzvySTSjGeF8bHB6y6AzI8WxVbAX2_IpmSeUNUx9YDv=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/117743515314060907691/reviews"
      },
      {
        "author": "Piotr Pim",
        "rating": 5,
        "text": "A very beautiful botanical garden. Many interesting plants, plenty of land to explore, well-maintained. It also has turtle and deer enclosures. One of the must-sees when visiting the island.\nUnfortunately, there are some mosquitoes.",
        "timeAgo": "2 weeks ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocKHSTIjb6HJb1BCk5caacrV51msQsZAJvfmeB066OqRIKM84A=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/112516550083449502130/reviews"
      },
      {
        "author": "Alex Howard",
        "rating": 4,
        "text": "Green, beautiful and peaceful. The park is generally very well looked after, although the ponds could be taken care of a bit better. It felt wonderful to be surrounded by so many different trees and plants. Take ALL the mosquito repellent!!!",
        "timeAgo": "2 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocLNsLcOinTic87okP9iyccvtM3eCluBkD4olEvkjX-ki5ua2g=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/112857845998549458923/reviews"
      },
      {
        "author": "Daniella Tejeira",
        "rating": 5,
        "text": "Best botanical garden I’ve ever been. There’s so much to see, the ticket price was reasonable. There were tour guides at the entrance, although we decided to go on our own. The map is quite straight-forward as all \"roads\" are labeled. Take your time, 2-3 hours should be enough.",
        "timeAgo": "3 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjWuofoWARzazs7HCAT1FhQSuyJ7KoNpkq9ComXZWN3eFaKGhsQp=s128-c0x00000000-cc-rp-mo-ba3",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/101715200695984287685/reviews"
      },
      {
        "author": "Djameel Hossen",
        "rating": 5,
        "text": "SSR Botanical Garden is a calm and beautiful place to visit. The garden has many trees, flowers, and the famous giant water lilies. You can also see animals like deer, turtles, fish, and birds. It is a great place to walk, relax, and enjoy nature with family. A very peaceful and refreshing spot!",
        "timeAgo": "3 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjV8A1yytnFNEw-raC-uoFl0jBsfmQzGrC_mE7cVYUWNFUjaJsRB=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/118117255980207649057/reviews"
      }
    ],
    "photos": [
      {
        "url": "/photos/pamplemousses-botanical-garden-0.jpg",
        "attribution": "Va Vo",
        "width": 3024,
        "height": 4032
      },
      {
        "url": "/photos/pamplemousses-botanical-garden-1.jpg",
        "attribution": "Christian K.",
        "width": 4800,
        "height": 3600
      },
      {
        "url": "/photos/pamplemousses-botanical-garden-2.jpg",
        "attribution": "Ruedi Ermatinger",
        "width": 2992,
        "height": 2992
      },
      {
        "url": "/photos/pamplemousses-botanical-garden-3.jpg",
        "attribution": "Stéphane GUILLEMOT",
        "width": 4032,
        "height": 3024
      },
      {
        "url": "/photos/pamplemousses-botanical-garden-4.jpg",
        "attribution": "A A",
        "width": 1200,
        "height": 1600
      }
    ]
  },
  "Flacq Market": {
    "googleRating": 4.1,
    "totalReviews": 3341,
    "googleMapsUrl": "https://maps.google.com/?cid=1813309801773054223&g_mp=CiVnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLkdldFBsYWNlEAIYBCAA",
    "reviews": [
      {
        "author": "Robert Barney",
        "rating": 3,
        "text": "Wednesdays and sundays. Its worth a visit to see what market is like in Mauritius I suppose. I don't want to be disparaging, I am sure its a great market for local people. But for tourists? If you aren't buying fruits, vegetables or spices, it's pretty much south asian and chinese toot that you can buy on temu. That said its not moody or dangerous. Would i go agaim? No.",
        "timeAgo": "a month ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjXf2gI8IEqipdGvZcqQIQs65UxTFlrJwO3UtZNbuFPrKoASc7aENA=s128-c0x00000000-cc-rp-mo-ba5",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/107528902302221474673/reviews"
      },
      {
        "author": "O and N",
        "rating": 4,
        "text": "A very nice market with lots of fruits and veg i could not find the meat area but I did get lots of veg. I was looking for souvenirs to bring home but only clothing Overall a very nice market. For meat and fish go before 4pm, best mornings. We managed to secure a fish.",
        "timeAgo": "6 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjU4YfAelZyB4PHv9y5WgPp3opmgXkxSI3gu_m9DDt4RE6RYVEM=s128-c0x00000000-cc-rp-mo-ba6",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/113118582898167722953/reviews"
      },
      {
        "author": "Tony Fiore",
        "rating": 5,
        "text": "Great place.. super busy and super hot 🔥",
        "timeAgo": "a week ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocJfmXvAuitYuEqAbiEL7Hn_lO5bHK0U1A0MH4klpHc14ZP5dQ=s128-c0x00000000-cc-rp-mo-ba2",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/109507689423559010086/reviews"
      },
      {
        "author": "Inder Pal Singh",
        "rating": 4,
        "text": "Wonderful market place with all types of fruit and veg for local people and souvenirs for tourists. A lot of different types of aubergines or eggplant. In addition eating places with street food. There were also flower bouquets.",
        "timeAgo": "a year ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjWrk27ZnOJhsvJ-ypgVb3xgH5usHxtVUqjOrkinqzSsTWV53zk=s128-c0x00000000-cc-rp-mo-ba5",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/112812074972830560344/reviews"
      },
      {
        "author": "sinead",
        "rating": 5,
        "text": "Worth a visit, amazing place, but keep your wits about you at all times. Personally I wouldn’t go there alone as a female. Be prepared to be heckled. The food section is fabulous, and the smells of fresh herbs amazing",
        "timeAgo": "a year ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocJzQYOy0LIdkkyQUzFp67wEzzTMENcvcPAHDQ1nYMb6yDscEA=s128-c0x00000000-cc-rp-mo-ba3",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/113209835646029690370/reviews"
      }
    ],
    "photos": [
      {
        "url": "/photos/flacq-market-0.jpg",
        "attribution": "Makoona Arvind",
        "width": 3968,
        "height": 2217
      },
      {
        "url": "/photos/flacq-market-1.jpg",
        "attribution": "Guido Kuhn",
        "width": 3499,
        "height": 1908
      },
      {
        "url": "/photos/flacq-market-2.jpg",
        "attribution": "Duncan Whyte",
        "width": 2252,
        "height": 4000
      },
      {
        "url": "/photos/flacq-market-3.jpg",
        "attribution": "Clarisse De Campos Martins",
        "width": 3024,
        "height": 4032
      },
      {
        "url": "/photos/flacq-market-4.jpg",
        "attribution": "Philippe Phiphi",
        "width": 4032,
        "height": 3024
      }
    ]
  },
  "Bois Chéri Tea Factory": {
    "googleRating": 4.3,
    "totalReviews": 3020,
    "googleMapsUrl": "https://maps.google.com/?cid=2544920944393548892&g_mp=CiVnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLkdldFBsYWNlEAIYBCAA",
    "editorialSummary": "Lakeside tea estate open for factory tours & tastings, plus feeding sessions for Java deer.",
    "reviews": [
      {
        "author": "Katarzyna",
        "rating": 4,
        "text": "The biggest disadvantage is the low selection of teas you can purchase there.\nVisiting the factory is fine, but don’t expect a long tour. A bit further away—900 meters from the factory—there’s a pleasant restaurant with amazing view, where they offer tea tasting, with a large selection available. The problem is that neither in the factory shop nor in the store by the restaurant can you buy the vast majority of the teas they present. They do have however a wide selection of alcohol.",
        "timeAgo": "2 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocIwodEovWzQ9z535j92gBfyERYsmZqzq9nG1SAHGkzphTld-g=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/108129823971016004281/reviews"
      },
      {
        "author": "Jennifer Lynn",
        "rating": 5,
        "text": "Highly recommend taking the tour - last tour before lunch is 1130 in french and tours don't resume until 1 or so. Best call or look up times before you go.\nTour includes unlimited tea tasting up by the restaurant - lots of parking there (1km from the factory, down a road that winds around a little lake. Chickens and rooster roam freely in tea tasting area.",
        "timeAgo": "2 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjXmSPx70m4PxjawzSODbYKfMSbEpHNHRjPB2flXRv58Tf-ZIKs=s128-c0x00000000-cc-rp-mo-ba6",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/107487373827418551695/reviews"
      },
      {
        "author": "Nikolett N",
        "rating": 5,
        "text": "It’s worth visiting the tea plantation and tasting the teas.\nThe surroundings are beautiful.\nIt’s charming to see roosters roaming around the area, and we even spotted a wild boar with her piglets.\nThe teas are delicious, and the prices are very reasonable.",
        "timeAgo": "2 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocIpLlq1CeuVItCoMCvWohPbtSuLvXTCQotzoWBuLw2I5XkRvw=s128-c0x00000000-cc-rp-mo-ba3",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/115322765218968088509/reviews"
      },
      {
        "author": "David Yelligadu",
        "rating": 5,
        "text": "We had the tea factory tour. It was well worth it, our guide answered our questions clearly and was amazing. The tour included tea tasting in the price. You get to try all the teas that they make. Price was Rs650 for tourists and Rs450 for locals.",
        "timeAgo": "2 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjWP6dDhG1kmf2WD6vtSjTCfSDErtDeolbupfIqKDnCRu3gQGmCvsg=s128-c0x00000000-cc-rp-mo-ba6",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/113332686824043743996/reviews"
      },
      {
        "author": "Kitty",
        "rating": 5,
        "text": "I’d been wanting to visit this tea factory for years, and it was such a wonderful experience 🌿. The museum was really interesting and gave a great insight into how tea is made in Mauritius and the history behind it.\n\nThe tea tasting was definitely a highlight 🍵 — it takes place in the restaurant with beautiful views over the tea fields 🌱, and we even saw a few animals while enjoying the teas.\n\nThe gift shop is also worth a stop, with lots of teas, flavoured rums , biscuits and other treats to bring home.\n\nOverall, it felt wholesome, relaxing, and truly memorable ✨ — I’d highly recommend",
        "timeAgo": "5 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjVgoC-i_O74qnZv3L2vQJ9rj3Gft59NAWMxiOPBPXniGqOjHT8=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/107467473321901513099/reviews"
      }
    ],
    "photos": [
      {
        "url": "/photos/bois-ch-ri-tea-factory-0.jpg",
        "attribution": "Yashley, Dharmesh Sharma Ramanund (Yush)",
        "width": 1080,
        "height": 810
      },
      {
        "url": "/photos/bois-ch-ri-tea-factory-1.jpg",
        "attribution": "Anja Sauer",
        "width": 4800,
        "height": 3600
      },
      {
        "url": "/photos/bois-ch-ri-tea-factory-2.jpg",
        "attribution": "Ralph Abrahams",
        "width": 3136,
        "height": 2352
      },
      {
        "url": "/photos/bois-ch-ri-tea-factory-3.jpg",
        "attribution": "Aga Mel",
        "width": 4032,
        "height": 3024
      },
      {
        "url": "/photos/bois-ch-ri-tea-factory-4.jpg",
        "attribution": "Hashem Al Hashem",
        "width": 4032,
        "height": 3024
      }
    ]
  },
  "Rhumerie de Chamarel": {
    "googleRating": 4.5,
    "totalReviews": 4294,
    "googleMapsUrl": "https://maps.google.com/?cid=11416505544506789548&g_mp=CiVnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLkdldFBsYWNlEAIYBCAA",
    "priceLevel": "$$$",
    "reviews": [
      {
        "author": "Jean-Francois Montoya",
        "rating": 5,
        "text": "The tour of the distillery is free if you reserve lunch. We walked up without réservation, but as they had availability about an hour later, we were able to join the tour that was just departing and have lunch afterwards. So it worked out perfect. The tour is brief, but interesting. And you get to taste quite a few different rum and liqueurs and there are limited edition ones you can taste for additional fees. The price is more than fair, so have a go at a few of the interesting sounding ones if any appeal to you. A nice shop afterward with some good souvenirs. Lunch was fantastic with well prepared dishes. The pork, which I had, is a signature plate. Highly recommend. It was unbelievably tender and delicious. The scallops were also perfectly cooked. Very tasty and interesting rum based cocktails as well. A little pricy, but not outrageous considering the quality and atmosphere. Very kind and welcoming staff.",
        "timeAgo": "a week ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjWNEBDs0a7v18st2QYj3jsi8vjzKpMEomCk6ls1k1t0v32U6-A=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/105211698549509269313/reviews"
      },
      {
        "author": "Hilla6",
        "rating": 5,
        "text": "We visited for the rum tour and tasting since the restaurant was already closed.\n\nWhile the rum tasting itself was fantastic - we got to try many unique and delicious blends made on-site, the tour was a bit disappointing.\n\nWe took the English tour, but the guide's English was very poor, making it quite difficult to understand.\n\nGreat experience for the rum, but hopefully they can improve the language accessibility of the tours!",
        "timeAgo": "a week ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjW4dXAtGa-yfU-FTPyLEyZK_k7BYHvjQ1UT1gpmYF22erO4HvA=s128-c0x00000000-cc-rp-mo-ba5",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/115596462670479836085/reviews"
      },
      {
        "author": "Sonia Becker",
        "rating": 5,
        "text": "We had a fantastic experience at Chamarel Rhumerie. The tour guide was extremely knowledgeable and provided a very informative and engaging tour. The tasting was generous, with plenty of shots to sample, which made it even more enjoyable.\n\nThe setting is beautiful, and it was fascinating to learn about the sugar industry in Mauritius and how rhum is produced. The souvenir shop is excellent, with a great variety and selection of rhum to purchase. I absolutely loved the mandarin liqueur, highly recommended!\nOverall, this is a must-do activity when visiting the island. A great experience from start to finish.",
        "timeAgo": "a month ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjWzziuFfw8XbRUsF5hyVIEQmthlmryoAis-BMZ7bzLUPAC9ilHjhA=s128-c0x00000000-cc-rp-mo-ba3",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/105426342924077676669/reviews"
      },
      {
        "author": "Vrishan Seesunkur",
        "rating": 2,
        "text": "This review is for the Rhum Tour only! Not the Restaurant.\n\nI am sad to be writing this review because this place used to be one of my top 3 on the island. I brought some British friends here for a proper rum experience, based on how much I loved my previous visits.\n\nInstead, it turned into a complete disaster. We paid Rs 650 for the entrance and the distillery tour and joined a group of around 12–15 people for the English tour. From the moment it started, the guide (I won’t name her, but management, please contact me personally) completely ruined it. She looked annoyed, barely spoke, and kept checking her phone and watch like she had somewhere better to be. When anyone asked a question, she responded rudely, making the whole group uncomfortable.\n\nThe rum tasting was just as bad. No explanations, no enthusiasm, nothing. Just a flat “this is this” with zero context. I could not believe how poorly the experience was handled. A place I once loved so much turned into one of the most disappointing visits ever. Absolute nonsense!",
        "timeAgo": "a month ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjVlUmd36IzvySTSjGeF8bHB6y6AzI8WxVbAX2_IpmSeUNUx9YDv=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/117743515314060907691/reviews"
      },
      {
        "author": "Melanie Klug",
        "rating": 5,
        "text": "We arrived just after 4 p.m. and were lucky to catch the very last tour before closing time at 4:30. The visit was quite fast-paced — maybe because it was the final group — but still interesting. We got to see the equipment used in rum production, learned about the process and how it’s stored. Then came the tasting, which was super generous: around a dozen varieties, from clear and aged rums to versions flavored with vanilla, coffee, and more. It was a lot of rum in a short time, but fun and well done. The place itself is beautiful, and the staff was really friendly.\n\nEverything is close by — the colorful Seven Coloured Earth and the waterfall are just around the corner — so you can easily combine it all into one perfect little day trip. There’s also a highly rated restaurant on-site, though we didn’t try it ourselves.",
        "timeAgo": "3 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjWoLUHfG55r5zvRnVkxIZA869MbOtLdLR17m8QBCIFk7BPRwmWi4g=s128-c0x00000000-cc-rp-mo-ba5",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/106496694378614135251/reviews"
      }
    ],
    "photos": [
      {
        "url": "/photos/rhumerie-de-chamarel-0.jpg",
        "attribution": "Kevin Willi",
        "width": 4000,
        "height": 3000
      },
      {
        "url": "/photos/rhumerie-de-chamarel-1.jpg",
        "attribution": "Jean-Francois Montoya",
        "width": 4800,
        "height": 3604
      },
      {
        "url": "/photos/rhumerie-de-chamarel-2.jpg",
        "attribution": "Christophe Jennet",
        "width": 3600,
        "height": 4800
      },
      {
        "url": "/photos/rhumerie-de-chamarel-3.jpg",
        "attribution": "Blanka Jagodzińska",
        "width": 4080,
        "height": 3072
      },
      {
        "url": "/photos/rhumerie-de-chamarel-4.jpg",
        "attribution": "Jean-Francois Montoya",
        "width": 4155,
        "height": 4800
      }
    ]
  },
  "Casela Nature Park": {
    "googleRating": 4.2,
    "totalReviews": 11758,
    "googleMapsUrl": "https://maps.google.com/?cid=1896914440360566696&g_mp=CiVnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLkdldFBsYWNlEAIYBCAA",
    "editorialSummary": "Huge outdoor amusement park with safari tours, camel rides & zip-lining, plus restaurants & shops.",
    "reviews": [
      {
        "author": "R I",
        "rating": 5,
        "text": "A wonderful experience in the open among big animals and a great staff! Most of the animals live freely; there are special activities like feeding birds or even a lion; caring a big cat or going on a safari; and everywhere the staff is great - helpful and with a nice sense of humour. It was more than a pleasure being there.\nIt is a whole day experience. It is beautiful. I definitely recommend it, especially for families.",
        "timeAgo": "a month ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocJQiNK9qusGaqmCNDJGo9LEUnmxFaOh_vAa2Bg-rMLth9hI9w=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/106483612490870109795/reviews"
      },
      {
        "author": "V Rama",
        "rating": 4,
        "text": "Lot of parking and located at a convenient place. If you want to enjoy and experience everything come early.\nWith just the entry fee you could enjoy most of the park ,see all animals , enjoy their roller coaster and animal safari where you see the zebra,deers,wilder beast,rhinos ,ostrich and giraffe.\nOther activities will get you up close and personal with the big cats.\nThese activities can be purchased from the many stations located at various parts of the park.",
        "timeAgo": "3 weeks ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjXffaxFWm1uHMiCzq-y55GrHiE6ZHm9wzWQ1wWJXd2W3HbsuEQi=s128-c0x00000000-cc-rp-mo-ba3",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/111274802878821778902/reviews"
      },
      {
        "author": "Daria Astapenko",
        "rating": 5,
        "text": "I want to thank Sandy, the incredible tour guide and driver. This incredible person made our day! 😍 We were a group of nine and we got Sandy, for which I am grateful to God. The excursion was incredible, the safari was amazing, and the animals were amazing. By the way, you can tell the animals love Sandy and know her. It was incredible. Thank you so much. If I go on safari, I'll only go with Sandy. 🥹❤️",
        "timeAgo": "a month ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjWhUJehEotqEnpQ70bgeBRsfVpFhzI9NFGa-7JL7HTYtHwzvw=s128-c0x00000000-cc-rp-mo",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/105355966852359161569/reviews"
      },
      {
        "author": "Helena Djuric",
        "rating": 4,
        "text": "The part where birds and predators are look like zoo. Whereas the fantastic option is to go for Safari Eco Rider because that is going to be the best experience of your life. You can go really close to animals, with the guid of course, and it’s very safe. I would definitely recommend this activity!",
        "timeAgo": "4 weeks ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjWh3KjV20N8a7ODYeMk0MnYj6uPaJCzoRHZPnMW8VIkjD5x37JfxA=s128-c0x00000000-cc-rp-mo-ba2",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/100464702350118001673/reviews"
      },
      {
        "author": "vineetha sk",
        "rating": 5,
        "text": "what can I say! words fail to describe how much we liked this park.... the animals were well looked after, one can see the effort the staff put to look after the animals, the animals are free to roam around, plenty of animal interaction,  my son refused to leave at the end of the day! I honestly feel they charge too little for what is on offer at this place. ..... would give more stars if I could.... went at 10 am , left at 5pm , did a Jeep safari, watched all the animals up close... amazing!!!!!!! there was a peacock in the loose, just walking around showing off, the aviary had a lot of curious parrots waiting to nibble on treats , there was a hungry llama we fed!!!",
        "timeAgo": "2 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjWDRxyUQj3LTx3hJ0aim8puc1q4whw1-N6mX-3F7lNREEKUNb4v=s128-c0x00000000-cc-rp-mo-ba6",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/100138428366571012528/reviews"
      }
    ],
    "photos": [
      {
        "url": "/photos/casela-nature-park-0.jpg",
        "attribution": "Casela Nature Parks | Best Nature Parks in Mauritius",
        "width": 4800,
        "height": 2352
      },
      {
        "url": "/photos/casela-nature-park-1.jpg",
        "attribution": "지리지리",
        "width": 4800,
        "height": 3200
      },
      {
        "url": "/photos/casela-nature-park-2.jpg",
        "attribution": "Obaid Siraj",
        "width": 3072,
        "height": 4096
      },
      {
        "url": "/photos/casela-nature-park-3.jpg",
        "attribution": "Ping Kim",
        "width": 4000,
        "height": 3000
      },
      {
        "url": "/photos/casela-nature-park-4.jpg",
        "attribution": "Mitsii Hk",
        "width": 1440,
        "height": 1440
      }
    ]
  },
  "La Vanille Nature Park": {
    "googleRating": 4.4,
    "totalReviews": 5132,
    "googleMapsUrl": "https://maps.google.com/?cid=6639309134932929292&g_mp=CiVnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLkdldFBsYWNlEAIYBCAA",
    "editorialSummary": "Park offering encounters with giant tortoises, crocodile feeding shows & other nature exhibits.",
    "reviews": [
      {
        "author": "Marketa Krajtova",
        "rating": 5,
        "text": "Very nice place to visit. Park is mainly with crocodiles and tortoises + few more species. It is small place, but very educative. Restaurant was great. We did baby crocodille feeding, which means 3 pieces of meat per person to feed a club of baby dinosaurs. Feeding tortoises was the best, they have so many of them! It was just great.",
        "timeAgo": "2 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocKMTE6Yfhd-ZXqRE5y8ge36KuG6ZBa5e3hwEJabcr00aM01RA=s128-c0x00000000-cc-rp-mo-ba2",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/108831613967189985830/reviews"
      },
      {
        "author": "Amna",
        "rating": 2,
        "text": "I was really disappointed with my visit to La Vanille Nature Park. If I had known the conditions beforehand, I wouldn’t have personally gone.\n\nSeemed to be cramped conditions — for example crocodiles in small enclosures, monkeys and bats in small cages, and animals that seem stressed rather than healthy.\n\nIt didn’t feel like a respectful wildlife or conservation experience, and the lack of clear information before visiting left me unprepared. For the ticket price and the distress I felt seeing some animals’ conditions, I can’t recommend this park until improvements are made.",
        "timeAgo": "a week ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocKPE3DEFQS31mY_iU0-idor4xEZDnQKddA8k7AppzMhGIBA=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/114912797861313464390/reviews"
      },
      {
        "author": "Awhan Mohanty",
        "rating": 5,
        "text": "​A fantastic, family-friendly outing at La Vanille!\n​Getting to the park was straightforward—Google Maps was accurate and led us right to the entrance. Parking was ample, which made for an easy start. Although we had booked tickets in advance, the queue at the entrance was thankfully short.\n​The main draws are definitely the reptiles! The crocodiles are impressive, and the Galápagos Giant Tortoises are truly the stars of the show. La Vanille seems to have the largest population of these magnificent tortoises in Mauritius, and it's amazing to see so many in one place.\n​Be sure to catch the thrilling Crocodile Feeding Show (held at 11:30 AM and 2:30 PM). It's a highlight! For those interested in a unique souvenir, you can pay a small additional fee to take a photo with a baby tortoise or even a young crocodile and a domesticated Iguana.\n​Other attractions include a fascinating Insectorium and various enclosures for deer, iguanas, and more. We took a casual stroll through the park and spent about 1.5 to 2 hours, though you could easily spend more time if you explore every exhibit thoroughly.\n​Overall, it's a great outing, especially for families with children. Highly recommended!",
        "timeAgo": "4 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocLmaeIZgRPD-k0v5eXTvk0f9UX1xUp6GAIWDI1sVDnOEPGOghfQ=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/113832757889873587344/reviews"
      },
      {
        "author": "Djameel Hossen",
        "rating": 5,
        "text": "La Vanille Crocodile Park is a fun and relaxing place to visit. The park is well maintained, surrounded by beautiful greenery, and has many animals like giant tortoises, crocodiles, iguanas and deer. Walking through the park feels peaceful and natural. The tortoise interaction is the highlight, especially for kids. There is also a small museum and a restaurant on site. Overall, it’s a pleasant family outing and a great place to enjoy nature and animals.",
        "timeAgo": "3 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjV8A1yytnFNEw-raC-uoFl0jBsfmQzGrC_mE7cVYUWNFUjaJsRB=s128-c0x00000000-cc-rp-mo-ba4",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/118117255980207649057/reviews"
      },
      {
        "author": "Jennifer",
        "rating": 5,
        "text": "Be sure to time your arrival at 1100h! That’s when the feeding of giant Aldabra tortoises start. It will coincide nicely with the crocodile feeding which only happens daily at 1130h.\n\nThe feeding of tortoises is something very memorable and special. The park isn’t very big as those are the two main attractions, with additional enclosures and displays of other animals.\n\nOne hour was sufficient to tour the whole area. I spent 975MUR for entrance tickets and another 90MUR for tortoise food.",
        "timeAgo": "2 months ago",
        "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjVwDZSMVR72xCQ145Ao_Jw3aHYeC6ErUF1SNyBDZhz2AtVGP_xHaA=s128-c0x00000000-cc-rp-mo-ba6",
        "googleMapsAuthorUrl": "https://www.google.com/maps/contrib/110520605084204408119/reviews"
      }
    ],
    "photos": [
      {
        "url": "/photos/la-vanille-nature-park-0.jpg",
        "attribution": "La Vanille Nature Park",
        "width": 4800,
        "height": 3200
      },
      {
        "url": "/photos/la-vanille-nature-park-1.jpg",
        "attribution": "Joanna Li",
        "width": 4032,
        "height": 3024
      },
      {
        "url": "/photos/la-vanille-nature-park-2.jpg",
        "attribution": "Martin Duff",
        "width": 4032,
        "height": 3024
      },
      {
        "url": "/photos/la-vanille-nature-park-3.jpg",
        "attribution": "charles hoss",
        "width": 4000,
        "height": 3008
      },
      {
        "url": "/photos/la-vanille-nature-park-4.jpg",
        "attribution": "Lenka Houdková",
        "width": 4032,
        "height": 3024
      }
    ]
  },
  "Grand Baie": {
    "googleMapsUrl": "https://maps.google.com/?cid=13002079920503578481&g_mp=CiVnb29nbGUubWFwcy5wbGFjZXMudjEuUGxhY2VzLkdldFBsYWNlEAIYBCAA",
    "reviews": [],
    "photos": [
      {
        "url": "/photos/grand-baie-0.jpg",
        "attribution": "Nayaz Mhd",
        "width": 4000,
        "height": 3000
      },
      {
        "url": "/photos/grand-baie-1.jpg",
        "attribution": "Suby Bhurosy",
        "width": 3000,
        "height": 4000
      },
      {
        "url": "/photos/grand-baie-2.jpg",
        "attribution": "David Pitois",
        "width": 4000,
        "height": 3000
      },
      {
        "url": "/photos/grand-baie-3.jpg",
        "attribution": "Kирил Иванов",
        "width": 4160,
        "height": 3120
      },
      {
        "url": "/photos/grand-baie-4.jpg",
        "attribution": "Mohamed Al Muhairi",
        "width": 1686,
        "height": 2529
      }
    ]
  }
}